HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxDma_reg.h
/** Alias (User Manual Name) for DMA_CH103_CHCFGR.
* To use register names with standard convension, please use DMA_CH103_CHCFGR.
*/
#define	DMA_CHCFGR103	(DMA_CH103_CHCFGR)

/** \\brief  2CFC, DMARAM Channel Control and Status Register */
#define DMA_CH103_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012CFCu)

/** Alias (User Manual Name) for DMA_CH103_CHCSR.
* To use register names with standard convension, please use DMA_CH103_CHCSR.
*/
#define	DMA_CHCSR103	(DMA_CH103_CHCSR)

/** \\brief  2CEC, DMA Channel Destination Address Register x */
#define DMA_CH103_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012CECu)

/** Alias (User Manual Name) for DMA_CH103_DADR.
* To use register names with standard convension, please use DMA_CH103_DADR.
*/
#define	DMA_DADR103	(DMA_CH103_DADR)

/** \\brief  2CE0, DMA Channel Read Data CRC Register */
#define DMA_CH103_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012CE0u)

/** Alias (User Manual Name) for DMA_CH103_RDCRCR.
* To use register names with standard convension, please use DMA_CH103_RDCRCR.
*/
#define	DMA_RDCRCR103	(DMA_CH103_RDCRCR)

/** \\brief  2CE8, DMA Channel Source Address Register */
#define DMA_CH103_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012CE8u)

/** Alias (User Manual Name) for DMA_CH103_SADR.
* To use register names with standard convension, please use DMA_CH103_SADR.
*/
#define	DMA_SADR103	(DMA_CH103_SADR)

/** \\brief  2CE4, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH103_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012CE4u)

/** Alias (User Manual Name) for DMA_CH103_SDCRCR.
* To use register names with standard convension, please use DMA_CH103_SDCRCR.
*/
#define	DMA_SDCRCR103	(DMA_CH103_SDCRCR)

/** \\brief  2CF8, DMA Channel Shadow Address Register */
#define DMA_CH103_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012CF8u)

/** Alias (User Manual Name) for DMA_CH103_SHADR.
* To use register names with standard convension, please use DMA_CH103_SHADR.
*/
#define	DMA_SHADR103	(DMA_CH103_SHADR)

/** \\brief  2D10, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH104_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012D10u)

/** Alias (User Manual Name) for DMA_CH104_ADICR.
* To use register names with standard convension, please use DMA_CH104_ADICR.
*/
#define	DMA_ADICR104	(DMA_CH104_ADICR)

/** \\brief  2D14, DMA Channel Configuration Register */
#define DMA_CH104_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012D14u)

/** Alias (User Manual Name) for DMA_CH104_CHCFGR.
* To use register names with standard convension, please use DMA_CH104_CHCFGR.
*/
#define	DMA_CHCFGR104	(DMA_CH104_CHCFGR)

/** \\brief  2D1C, DMARAM Channel Control and Status Register */
#define DMA_CH104_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012D1Cu)

/** Alias (User Manual Name) for DMA_CH104_CHCSR.
* To use register names with standard convension, please use DMA_CH104_CHCSR.
*/
#define	DMA_CHCSR104	(DMA_CH104_CHCSR)

/** \\brief  2D0C, DMA Channel Destination Address Register x */
#define DMA_CH104_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012D0Cu)

/** Alias (User Manual Name) for DMA_CH104_DADR.
* To use register names with standard convension, please use DMA_CH104_DADR.
*/
#define	DMA_DADR104	(DMA_CH104_DADR)

/** \\brief  2D00, DMA Channel Read Data CRC Register */
#define DMA_CH104_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012D00u)

/** Alias (User Manual Name) for DMA_CH104_RDCRCR.
* To use register names with standard convension, please use DMA_CH104_RDCRCR.
*/
#define	DMA_RDCRCR104	(DMA_CH104_RDCRCR)

/** \\brief  2D08, DMA Channel Source Address Register */
#define DMA_CH104_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012D08u)

/** Alias (User Manual Name) for DMA_CH104_SADR.
* To use register names with standard convension, please use DMA_CH104_SADR.
*/
#define	DMA_SADR104	(DMA_CH104_SADR)

/** \\brief  2D04, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH104_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012D04u)

/** Alias (User Manual Name) for DMA_CH104_SDCRCR.
* To use register names with standard convension, please use DMA_CH104_SDCRCR.
*/
#define	DMA_SDCRCR104	(DMA_CH104_SDCRCR)

/** \\brief  2D18, DMA Channel Shadow Address Register */
#define DMA_CH104_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012D18u)

/** Alias (User Manual Name) for DMA_CH104_SHADR.
* To use register names with standard convension, please use DMA_CH104_SHADR.
*/
#define	DMA_SHADR104	(DMA_CH104_SHADR)

/** \\brief  2D30, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH105_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012D30u)

/** Alias (User Manual Name) for DMA_CH105_ADICR.
* To use register names with standard convension, please use DMA_CH105_ADICR.
*/
#define	DMA_ADICR105	(DMA_CH105_ADICR)

/** \\brief  2D34, DMA Channel Configuration Register */
#define DMA_CH105_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012D34u)

/** Alias (User Manual Name) for DMA_CH105_CHCFGR.
* To use register names with standard convension, please use DMA_CH105_CHCFGR.
*/
#define	DMA_CHCFGR105	(DMA_CH105_CHCFGR)

/** \\brief  2D3C, DMARAM Channel Control and Status Register */
#define DMA_CH105_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012D3Cu)

/** Alias (User Manual Name) for DMA_CH105_CHCSR.
* To use register names with standard convension, please use DMA_CH105_CHCSR.
*/
#define	DMA_CHCSR105	(DMA_CH105_CHCSR)

/** \\brief  2D2C, DMA Channel Destination Address Register x */
#define DMA_CH105_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012D2Cu)

/** Alias (User Manual Name) for DMA_CH105_DADR.
* To use register names with standard convension, please use DMA_CH105_DADR.
*/
#define	DMA_DADR105	(DMA_CH105_DADR)

/** \\brief  2D20, DMA Channel Read Data CRC Register */
#define DMA_CH105_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012D20u)

/** Alias (User Manual Name) for DMA_CH105_RDCRCR.
* To use register names with standard convension, please use DMA_CH105_RDCRCR.
*/
#define	DMA_RDCRCR105	(DMA_CH105_RDCRCR)

