HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxDma_reg.h
/** \\brief  2D28, DMA Channel Source Address Register */
#define DMA_CH105_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012D28u)

/** Alias (User Manual Name) for DMA_CH105_SADR.
* To use register names with standard convension, please use DMA_CH105_SADR.
*/
#define	DMA_SADR105	(DMA_CH105_SADR)

/** \\brief  2D24, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH105_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012D24u)

/** Alias (User Manual Name) for DMA_CH105_SDCRCR.
* To use register names with standard convension, please use DMA_CH105_SDCRCR.
*/
#define	DMA_SDCRCR105	(DMA_CH105_SDCRCR)

/** \\brief  2D38, DMA Channel Shadow Address Register */
#define DMA_CH105_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012D38u)

/** Alias (User Manual Name) for DMA_CH105_SHADR.
* To use register names with standard convension, please use DMA_CH105_SHADR.
*/
#define	DMA_SHADR105	(DMA_CH105_SHADR)

/** \\brief  2D50, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH106_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012D50u)

/** Alias (User Manual Name) for DMA_CH106_ADICR.
* To use register names with standard convension, please use DMA_CH106_ADICR.
*/
#define	DMA_ADICR106	(DMA_CH106_ADICR)

/** \\brief  2D54, DMA Channel Configuration Register */
#define DMA_CH106_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012D54u)

/** Alias (User Manual Name) for DMA_CH106_CHCFGR.
* To use register names with standard convension, please use DMA_CH106_CHCFGR.
*/
#define	DMA_CHCFGR106	(DMA_CH106_CHCFGR)

/** \\brief  2D5C, DMARAM Channel Control and Status Register */
#define DMA_CH106_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012D5Cu)

/** Alias (User Manual Name) for DMA_CH106_CHCSR.
* To use register names with standard convension, please use DMA_CH106_CHCSR.
*/
#define	DMA_CHCSR106	(DMA_CH106_CHCSR)

/** \\brief  2D4C, DMA Channel Destination Address Register x */
#define DMA_CH106_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012D4Cu)

/** Alias (User Manual Name) for DMA_CH106_DADR.
* To use register names with standard convension, please use DMA_CH106_DADR.
*/
#define	DMA_DADR106	(DMA_CH106_DADR)

/** \\brief  2D40, DMA Channel Read Data CRC Register */
#define DMA_CH106_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012D40u)

/** Alias (User Manual Name) for DMA_CH106_RDCRCR.
* To use register names with standard convension, please use DMA_CH106_RDCRCR.
*/
#define	DMA_RDCRCR106	(DMA_CH106_RDCRCR)

/** \\brief  2D48, DMA Channel Source Address Register */
#define DMA_CH106_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012D48u)

/** Alias (User Manual Name) for DMA_CH106_SADR.
* To use register names with standard convension, please use DMA_CH106_SADR.
*/
#define	DMA_SADR106	(DMA_CH106_SADR)

/** \\brief  2D44, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH106_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012D44u)

/** Alias (User Manual Name) for DMA_CH106_SDCRCR.
* To use register names with standard convension, please use DMA_CH106_SDCRCR.
*/
#define	DMA_SDCRCR106	(DMA_CH106_SDCRCR)

/** \\brief  2D58, DMA Channel Shadow Address Register */
#define DMA_CH106_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012D58u)

/** Alias (User Manual Name) for DMA_CH106_SHADR.
* To use register names with standard convension, please use DMA_CH106_SHADR.
*/
#define	DMA_SHADR106	(DMA_CH106_SHADR)

/** \\brief  2D70, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH107_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012D70u)

/** Alias (User Manual Name) for DMA_CH107_ADICR.
* To use register names with standard convension, please use DMA_CH107_ADICR.
*/
#define	DMA_ADICR107	(DMA_CH107_ADICR)

/** \\brief  2D74, DMA Channel Configuration Register */
#define DMA_CH107_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012D74u)

/** Alias (User Manual Name) for DMA_CH107_CHCFGR.
* To use register names with standard convension, please use DMA_CH107_CHCFGR.
*/
#define	DMA_CHCFGR107	(DMA_CH107_CHCFGR)

/** \\brief  2D7C, DMARAM Channel Control and Status Register */
#define DMA_CH107_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012D7Cu)

/** Alias (User Manual Name) for DMA_CH107_CHCSR.
* To use register names with standard convension, please use DMA_CH107_CHCSR.
*/
#define	DMA_CHCSR107	(DMA_CH107_CHCSR)

/** \\brief  2D6C, DMA Channel Destination Address Register x */
#define DMA_CH107_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012D6Cu)

/** Alias (User Manual Name) for DMA_CH107_DADR.
* To use register names with standard convension, please use DMA_CH107_DADR.
*/
#define	DMA_DADR107	(DMA_CH107_DADR)

/** \\brief  2D60, DMA Channel Read Data CRC Register */
#define DMA_CH107_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012D60u)

/** Alias (User Manual Name) for DMA_CH107_RDCRCR.
* To use register names with standard convension, please use DMA_CH107_RDCRCR.
*/
#define	DMA_RDCRCR107	(DMA_CH107_RDCRCR)

/** \\brief  2D68, DMA Channel Source Address Register */
#define DMA_CH107_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012D68u)

/** Alias (User Manual Name) for DMA_CH107_SADR.
* To use register names with standard convension, please use DMA_CH107_SADR.
*/
#define	DMA_SADR107	(DMA_CH107_SADR)

/** \\brief  2D64, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH107_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012D64u)

/** Alias (User Manual Name) for DMA_CH107_SDCRCR.
* To use register names with standard convension, please use DMA_CH107_SDCRCR.
*/
#define	DMA_SDCRCR107	(DMA_CH107_SDCRCR)

/** \\brief  2D78, DMA Channel Shadow Address Register */
#define DMA_CH107_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012D78u)

/** Alias (User Manual Name) for DMA_CH107_SHADR.
* To use register names with standard convension, please use DMA_CH107_SHADR.
*/
#define	DMA_SHADR107	(DMA_CH107_SHADR)

