HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxDma_reg.h
/** Alias (User Manual Name) for DMA_CH123_RDCRCR.
* To use register names with standard convension, please use DMA_CH123_RDCRCR.
*/
#define	DMA_RDCRCR123	(DMA_CH123_RDCRCR)

/** \\brief  2F68, DMA Channel Source Address Register */
#define DMA_CH123_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012F68u)

/** Alias (User Manual Name) for DMA_CH123_SADR.
* To use register names with standard convension, please use DMA_CH123_SADR.
*/
#define	DMA_SADR123	(DMA_CH123_SADR)

/** \\brief  2F64, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH123_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012F64u)

/** Alias (User Manual Name) for DMA_CH123_SDCRCR.
* To use register names with standard convension, please use DMA_CH123_SDCRCR.
*/
#define	DMA_SDCRCR123	(DMA_CH123_SDCRCR)

/** \\brief  2F78, DMA Channel Shadow Address Register */
#define DMA_CH123_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012F78u)

/** Alias (User Manual Name) for DMA_CH123_SHADR.
* To use register names with standard convension, please use DMA_CH123_SHADR.
*/
#define	DMA_SHADR123	(DMA_CH123_SHADR)

/** \\brief  2F90, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH124_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012F90u)

/** Alias (User Manual Name) for DMA_CH124_ADICR.
* To use register names with standard convension, please use DMA_CH124_ADICR.
*/
#define	DMA_ADICR124	(DMA_CH124_ADICR)

/** \\brief  2F94, DMA Channel Configuration Register */
#define DMA_CH124_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012F94u)

/** Alias (User Manual Name) for DMA_CH124_CHCFGR.
* To use register names with standard convension, please use DMA_CH124_CHCFGR.
*/
#define	DMA_CHCFGR124	(DMA_CH124_CHCFGR)

/** \\brief  2F9C, DMARAM Channel Control and Status Register */
#define DMA_CH124_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012F9Cu)

/** Alias (User Manual Name) for DMA_CH124_CHCSR.
* To use register names with standard convension, please use DMA_CH124_CHCSR.
*/
#define	DMA_CHCSR124	(DMA_CH124_CHCSR)

/** \\brief  2F8C, DMA Channel Destination Address Register x */
#define DMA_CH124_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012F8Cu)

/** Alias (User Manual Name) for DMA_CH124_DADR.
* To use register names with standard convension, please use DMA_CH124_DADR.
*/
#define	DMA_DADR124	(DMA_CH124_DADR)

/** \\brief  2F80, DMA Channel Read Data CRC Register */
#define DMA_CH124_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012F80u)

/** Alias (User Manual Name) for DMA_CH124_RDCRCR.
* To use register names with standard convension, please use DMA_CH124_RDCRCR.
*/
#define	DMA_RDCRCR124	(DMA_CH124_RDCRCR)

/** \\brief  2F88, DMA Channel Source Address Register */
#define DMA_CH124_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012F88u)

/** Alias (User Manual Name) for DMA_CH124_SADR.
* To use register names with standard convension, please use DMA_CH124_SADR.
*/
#define	DMA_SADR124	(DMA_CH124_SADR)

/** \\brief  2F84, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH124_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012F84u)

/** Alias (User Manual Name) for DMA_CH124_SDCRCR.
* To use register names with standard convension, please use DMA_CH124_SDCRCR.
*/
#define	DMA_SDCRCR124	(DMA_CH124_SDCRCR)

/** \\brief  2F98, DMA Channel Shadow Address Register */
#define DMA_CH124_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012F98u)

/** Alias (User Manual Name) for DMA_CH124_SHADR.
* To use register names with standard convension, please use DMA_CH124_SHADR.
*/
#define	DMA_SHADR124	(DMA_CH124_SHADR)

/** \\brief  2FB0, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH125_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012FB0u)

/** Alias (User Manual Name) for DMA_CH125_ADICR.
* To use register names with standard convension, please use DMA_CH125_ADICR.
*/
#define	DMA_ADICR125	(DMA_CH125_ADICR)

/** \\brief  2FB4, DMA Channel Configuration Register */
#define DMA_CH125_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012FB4u)

/** Alias (User Manual Name) for DMA_CH125_CHCFGR.
* To use register names with standard convension, please use DMA_CH125_CHCFGR.
*/
#define	DMA_CHCFGR125	(DMA_CH125_CHCFGR)

/** \\brief  2FBC, DMARAM Channel Control and Status Register */
#define DMA_CH125_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012FBCu)

/** Alias (User Manual Name) for DMA_CH125_CHCSR.
* To use register names with standard convension, please use DMA_CH125_CHCSR.
*/
#define	DMA_CHCSR125	(DMA_CH125_CHCSR)

/** \\brief  2FAC, DMA Channel Destination Address Register x */
#define DMA_CH125_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012FACu)

/** Alias (User Manual Name) for DMA_CH125_DADR.
* To use register names with standard convension, please use DMA_CH125_DADR.
*/
#define	DMA_DADR125	(DMA_CH125_DADR)

/** \\brief  2FA0, DMA Channel Read Data CRC Register */
#define DMA_CH125_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012FA0u)

/** Alias (User Manual Name) for DMA_CH125_RDCRCR.
* To use register names with standard convension, please use DMA_CH125_RDCRCR.
*/
#define	DMA_RDCRCR125	(DMA_CH125_RDCRCR)

/** \\brief  2FA8, DMA Channel Source Address Register */
#define DMA_CH125_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012FA8u)

/** Alias (User Manual Name) for DMA_CH125_SADR.
* To use register names with standard convension, please use DMA_CH125_SADR.
*/
#define	DMA_SADR125	(DMA_CH125_SADR)

/** \\brief  2FA4, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH125_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012FA4u)

/** Alias (User Manual Name) for DMA_CH125_SDCRCR.
* To use register names with standard convension, please use DMA_CH125_SDCRCR.
*/
#define	DMA_SDCRCR125	(DMA_CH125_SDCRCR)

/** \\brief  2FB8, DMA Channel Shadow Address Register */
#define DMA_CH125_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012FB8u)

