HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxDma_reg.h
/** Alias (User Manual Name) for DMA_CH125_SHADR.
* To use register names with standard convension, please use DMA_CH125_SHADR.
*/
#define	DMA_SHADR125	(DMA_CH125_SHADR)

/** \\brief  2FD0, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH126_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012FD0u)

/** Alias (User Manual Name) for DMA_CH126_ADICR.
* To use register names with standard convension, please use DMA_CH126_ADICR.
*/
#define	DMA_ADICR126	(DMA_CH126_ADICR)

/** \\brief  2FD4, DMA Channel Configuration Register */
#define DMA_CH126_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012FD4u)

/** Alias (User Manual Name) for DMA_CH126_CHCFGR.
* To use register names with standard convension, please use DMA_CH126_CHCFGR.
*/
#define	DMA_CHCFGR126	(DMA_CH126_CHCFGR)

/** \\brief  2FDC, DMARAM Channel Control and Status Register */
#define DMA_CH126_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012FDCu)

/** Alias (User Manual Name) for DMA_CH126_CHCSR.
* To use register names with standard convension, please use DMA_CH126_CHCSR.
*/
#define	DMA_CHCSR126	(DMA_CH126_CHCSR)

/** \\brief  2FCC, DMA Channel Destination Address Register x */
#define DMA_CH126_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012FCCu)

/** Alias (User Manual Name) for DMA_CH126_DADR.
* To use register names with standard convension, please use DMA_CH126_DADR.
*/
#define	DMA_DADR126	(DMA_CH126_DADR)

/** \\brief  2FC0, DMA Channel Read Data CRC Register */
#define DMA_CH126_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012FC0u)

/** Alias (User Manual Name) for DMA_CH126_RDCRCR.
* To use register names with standard convension, please use DMA_CH126_RDCRCR.
*/
#define	DMA_RDCRCR126	(DMA_CH126_RDCRCR)

/** \\brief  2FC8, DMA Channel Source Address Register */
#define DMA_CH126_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012FC8u)

/** Alias (User Manual Name) for DMA_CH126_SADR.
* To use register names with standard convension, please use DMA_CH126_SADR.
*/
#define	DMA_SADR126	(DMA_CH126_SADR)

/** \\brief  2FC4, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH126_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012FC4u)

/** Alias (User Manual Name) for DMA_CH126_SDCRCR.
* To use register names with standard convension, please use DMA_CH126_SDCRCR.
*/
#define	DMA_SDCRCR126	(DMA_CH126_SDCRCR)

/** \\brief  2FD8, DMA Channel Shadow Address Register */
#define DMA_CH126_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012FD8u)

/** Alias (User Manual Name) for DMA_CH126_SHADR.
* To use register names with standard convension, please use DMA_CH126_SHADR.
*/
#define	DMA_SHADR126	(DMA_CH126_SHADR)

/** \\brief  2FF0, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH127_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012FF0u)

/** Alias (User Manual Name) for DMA_CH127_ADICR.
* To use register names with standard convension, please use DMA_CH127_ADICR.
*/
#define	DMA_ADICR127	(DMA_CH127_ADICR)

/** \\brief  2FF4, DMA Channel Configuration Register */
#define DMA_CH127_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012FF4u)

/** Alias (User Manual Name) for DMA_CH127_CHCFGR.
* To use register names with standard convension, please use DMA_CH127_CHCFGR.
*/
#define	DMA_CHCFGR127	(DMA_CH127_CHCFGR)

/** \\brief  2FFC, DMARAM Channel Control and Status Register */
#define DMA_CH127_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012FFCu)

/** Alias (User Manual Name) for DMA_CH127_CHCSR.
* To use register names with standard convension, please use DMA_CH127_CHCSR.
*/
#define	DMA_CHCSR127	(DMA_CH127_CHCSR)

/** \\brief  2FEC, DMA Channel Destination Address Register x */
#define DMA_CH127_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012FECu)

/** Alias (User Manual Name) for DMA_CH127_DADR.
* To use register names with standard convension, please use DMA_CH127_DADR.
*/
#define	DMA_DADR127	(DMA_CH127_DADR)

/** \\brief  2FE0, DMA Channel Read Data CRC Register */
#define DMA_CH127_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012FE0u)

/** Alias (User Manual Name) for DMA_CH127_RDCRCR.
* To use register names with standard convension, please use DMA_CH127_RDCRCR.
*/
#define	DMA_RDCRCR127	(DMA_CH127_RDCRCR)

/** \\brief  2FE8, DMA Channel Source Address Register */
#define DMA_CH127_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012FE8u)

/** Alias (User Manual Name) for DMA_CH127_SADR.
* To use register names with standard convension, please use DMA_CH127_SADR.
*/
#define	DMA_SADR127	(DMA_CH127_SADR)

/** \\brief  2FE4, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH127_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012FE4u)

/** Alias (User Manual Name) for DMA_CH127_SDCRCR.
* To use register names with standard convension, please use DMA_CH127_SDCRCR.
*/
#define	DMA_SDCRCR127	(DMA_CH127_SDCRCR)

/** \\brief  2FF8, DMA Channel Shadow Address Register */
#define DMA_CH127_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012FF8u)

/** Alias (User Manual Name) for DMA_CH127_SHADR.
* To use register names with standard convension, please use DMA_CH127_SHADR.
*/
#define	DMA_SHADR127	(DMA_CH127_SHADR)

/** \\brief  2190, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH12_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012190u)

/** Alias (User Manual Name) for DMA_CH12_ADICR.
* To use register names with standard convension, please use DMA_CH12_ADICR.
*/
#define	DMA_ADICR012	(DMA_CH12_ADICR)

/** \\brief  2194, DMA Channel Configuration Register */
#define DMA_CH12_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012194u)

/** Alias (User Manual Name) for DMA_CH12_CHCFGR.
* To use register names with standard convension, please use DMA_CH12_CHCFGR.
*/
#define	DMA_CHCFGR012	(DMA_CH12_CHCFGR)

/** \\brief  219C, DMARAM Channel Control and Status Register */
#define DMA_CH12_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF001219Cu)

/** Alias (User Manual Name) for DMA_CH12_CHCSR.
* To use register names with standard convension, please use DMA_CH12_CHCSR.
*/
#define	DMA_CHCSR012	(DMA_CH12_CHCSR)

/** \\brief  218C, DMA Channel Destination Address Register x */
#define DMA_CH12_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF001218Cu)

/** Alias (User Manual Name) for DMA_CH12_DADR.
* To use register names with standard convension, please use DMA_CH12_DADR.
*/
#define	DMA_DADR012	(DMA_CH12_DADR)

/** \\brief  2180, DMA Channel Read Data CRC Register */
#define DMA_CH12_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012180u)

/** Alias (User Manual Name) for DMA_CH12_RDCRCR.
* To use register names with standard convension, please use DMA_CH12_RDCRCR.
*/
#define	DMA_RDCRCR012	(DMA_CH12_RDCRCR)

