HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxDma_reg.h
/** \\brief  28C0, DMA Channel Read Data CRC Register */
#define DMA_CH70_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF00128C0u)

/** Alias (User Manual Name) for DMA_CH70_RDCRCR.
* To use register names with standard convension, please use DMA_CH70_RDCRCR.
*/
#define	DMA_RDCRCR070	(DMA_CH70_RDCRCR)

/** \\brief  28C8, DMA Channel Source Address Register */
#define DMA_CH70_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF00128C8u)

/** Alias (User Manual Name) for DMA_CH70_SADR.
* To use register names with standard convension, please use DMA_CH70_SADR.
*/
#define	DMA_SADR070	(DMA_CH70_SADR)

/** \\brief  28C4, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH70_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF00128C4u)

/** Alias (User Manual Name) for DMA_CH70_SDCRCR.
* To use register names with standard convension, please use DMA_CH70_SDCRCR.
*/
#define	DMA_SDCRCR070	(DMA_CH70_SDCRCR)

/** \\brief  28D8, DMA Channel Shadow Address Register */
#define DMA_CH70_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF00128D8u)

/** Alias (User Manual Name) for DMA_CH70_SHADR.
* To use register names with standard convension, please use DMA_CH70_SHADR.
*/
#define	DMA_SHADR070	(DMA_CH70_SHADR)

/** \\brief  28F0, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH71_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF00128F0u)

/** Alias (User Manual Name) for DMA_CH71_ADICR.
* To use register names with standard convension, please use DMA_CH71_ADICR.
*/
#define	DMA_ADICR071	(DMA_CH71_ADICR)

/** \\brief  28F4, DMA Channel Configuration Register */
#define DMA_CH71_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF00128F4u)

/** Alias (User Manual Name) for DMA_CH71_CHCFGR.
* To use register names with standard convension, please use DMA_CH71_CHCFGR.
*/
#define	DMA_CHCFGR071	(DMA_CH71_CHCFGR)

/** \\brief  28FC, DMARAM Channel Control and Status Register */
#define DMA_CH71_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF00128FCu)

/** Alias (User Manual Name) for DMA_CH71_CHCSR.
* To use register names with standard convension, please use DMA_CH71_CHCSR.
*/
#define	DMA_CHCSR071	(DMA_CH71_CHCSR)

/** \\brief  28EC, DMA Channel Destination Address Register x */
#define DMA_CH71_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF00128ECu)

/** Alias (User Manual Name) for DMA_CH71_DADR.
* To use register names with standard convension, please use DMA_CH71_DADR.
*/
#define	DMA_DADR071	(DMA_CH71_DADR)

/** \\brief  28E0, DMA Channel Read Data CRC Register */
#define DMA_CH71_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF00128E0u)

/** Alias (User Manual Name) for DMA_CH71_RDCRCR.
* To use register names with standard convension, please use DMA_CH71_RDCRCR.
*/
#define	DMA_RDCRCR071	(DMA_CH71_RDCRCR)

/** \\brief  28E8, DMA Channel Source Address Register */
#define DMA_CH71_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF00128E8u)

/** Alias (User Manual Name) for DMA_CH71_SADR.
* To use register names with standard convension, please use DMA_CH71_SADR.
*/
#define	DMA_SADR071	(DMA_CH71_SADR)

/** \\brief  28E4, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH71_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF00128E4u)

/** Alias (User Manual Name) for DMA_CH71_SDCRCR.
* To use register names with standard convension, please use DMA_CH71_SDCRCR.
*/
#define	DMA_SDCRCR071	(DMA_CH71_SDCRCR)

/** \\brief  28F8, DMA Channel Shadow Address Register */
#define DMA_CH71_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF00128F8u)

/** Alias (User Manual Name) for DMA_CH71_SHADR.
* To use register names with standard convension, please use DMA_CH71_SHADR.
*/
#define	DMA_SHADR071	(DMA_CH71_SHADR)

/** \\brief  2910, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH72_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012910u)

/** Alias (User Manual Name) for DMA_CH72_ADICR.
* To use register names with standard convension, please use DMA_CH72_ADICR.
*/
#define	DMA_ADICR072	(DMA_CH72_ADICR)

/** \\brief  2914, DMA Channel Configuration Register */
#define DMA_CH72_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012914u)

/** Alias (User Manual Name) for DMA_CH72_CHCFGR.
* To use register names with standard convension, please use DMA_CH72_CHCFGR.
*/
#define	DMA_CHCFGR072	(DMA_CH72_CHCFGR)

/** \\brief  291C, DMARAM Channel Control and Status Register */
#define DMA_CH72_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF001291Cu)

/** Alias (User Manual Name) for DMA_CH72_CHCSR.
* To use register names with standard convension, please use DMA_CH72_CHCSR.
*/
#define	DMA_CHCSR072	(DMA_CH72_CHCSR)

/** \\brief  290C, DMA Channel Destination Address Register x */
#define DMA_CH72_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF001290Cu)

/** Alias (User Manual Name) for DMA_CH72_DADR.
* To use register names with standard convension, please use DMA_CH72_DADR.
*/
#define	DMA_DADR072	(DMA_CH72_DADR)

/** \\brief  2900, DMA Channel Read Data CRC Register */
#define DMA_CH72_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012900u)

/** Alias (User Manual Name) for DMA_CH72_RDCRCR.
* To use register names with standard convension, please use DMA_CH72_RDCRCR.
*/
#define	DMA_RDCRCR072	(DMA_CH72_RDCRCR)

/** \\brief  2908, DMA Channel Source Address Register */
#define DMA_CH72_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012908u)

/** Alias (User Manual Name) for DMA_CH72_SADR.
* To use register names with standard convension, please use DMA_CH72_SADR.
*/
#define	DMA_SADR072	(DMA_CH72_SADR)

/** \\brief  2904, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH72_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012904u)

/** Alias (User Manual Name) for DMA_CH72_SDCRCR.
* To use register names with standard convension, please use DMA_CH72_SDCRCR.
*/
#define	DMA_SDCRCR072	(DMA_CH72_SDCRCR)

/** \\brief  2918, DMA Channel Shadow Address Register */
#define DMA_CH72_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012918u)

