HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxDma_reg.h
/** Alias (User Manual Name) for DMA_CH75_CHCSR.
* To use register names with standard convension, please use DMA_CH75_CHCSR.
*/
#define	DMA_CHCSR075	(DMA_CH75_CHCSR)

/** \\brief  296C, DMA Channel Destination Address Register x */
#define DMA_CH75_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF001296Cu)

/** Alias (User Manual Name) for DMA_CH75_DADR.
* To use register names with standard convension, please use DMA_CH75_DADR.
*/
#define	DMA_DADR075	(DMA_CH75_DADR)

/** \\brief  2960, DMA Channel Read Data CRC Register */
#define DMA_CH75_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012960u)

/** Alias (User Manual Name) for DMA_CH75_RDCRCR.
* To use register names with standard convension, please use DMA_CH75_RDCRCR.
*/
#define	DMA_RDCRCR075	(DMA_CH75_RDCRCR)

/** \\brief  2968, DMA Channel Source Address Register */
#define DMA_CH75_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012968u)

/** Alias (User Manual Name) for DMA_CH75_SADR.
* To use register names with standard convension, please use DMA_CH75_SADR.
*/
#define	DMA_SADR075	(DMA_CH75_SADR)

/** \\brief  2964, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH75_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012964u)

/** Alias (User Manual Name) for DMA_CH75_SDCRCR.
* To use register names with standard convension, please use DMA_CH75_SDCRCR.
*/
#define	DMA_SDCRCR075	(DMA_CH75_SDCRCR)

/** \\brief  2978, DMA Channel Shadow Address Register */
#define DMA_CH75_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012978u)

/** Alias (User Manual Name) for DMA_CH75_SHADR.
* To use register names with standard convension, please use DMA_CH75_SHADR.
*/
#define	DMA_SHADR075	(DMA_CH75_SHADR)

/** \\brief  2990, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH76_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012990u)

/** Alias (User Manual Name) for DMA_CH76_ADICR.
* To use register names with standard convension, please use DMA_CH76_ADICR.
*/
#define	DMA_ADICR076	(DMA_CH76_ADICR)

/** \\brief  2994, DMA Channel Configuration Register */
#define DMA_CH76_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012994u)

/** Alias (User Manual Name) for DMA_CH76_CHCFGR.
* To use register names with standard convension, please use DMA_CH76_CHCFGR.
*/
#define	DMA_CHCFGR076	(DMA_CH76_CHCFGR)

/** \\brief  299C, DMARAM Channel Control and Status Register */
#define DMA_CH76_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF001299Cu)

/** Alias (User Manual Name) for DMA_CH76_CHCSR.
* To use register names with standard convension, please use DMA_CH76_CHCSR.
*/
#define	DMA_CHCSR076	(DMA_CH76_CHCSR)

/** \\brief  298C, DMA Channel Destination Address Register x */
#define DMA_CH76_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF001298Cu)

/** Alias (User Manual Name) for DMA_CH76_DADR.
* To use register names with standard convension, please use DMA_CH76_DADR.
*/
#define	DMA_DADR076	(DMA_CH76_DADR)

/** \\brief  2980, DMA Channel Read Data CRC Register */
#define DMA_CH76_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012980u)

/** Alias (User Manual Name) for DMA_CH76_RDCRCR.
* To use register names with standard convension, please use DMA_CH76_RDCRCR.
*/
#define	DMA_RDCRCR076	(DMA_CH76_RDCRCR)

/** \\brief  2988, DMA Channel Source Address Register */
#define DMA_CH76_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012988u)

/** Alias (User Manual Name) for DMA_CH76_SADR.
* To use register names with standard convension, please use DMA_CH76_SADR.
*/
#define	DMA_SADR076	(DMA_CH76_SADR)

/** \\brief  2984, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH76_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012984u)

/** Alias (User Manual Name) for DMA_CH76_SDCRCR.
* To use register names with standard convension, please use DMA_CH76_SDCRCR.
*/
#define	DMA_SDCRCR076	(DMA_CH76_SDCRCR)

/** \\brief  2998, DMA Channel Shadow Address Register */
#define DMA_CH76_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012998u)

/** Alias (User Manual Name) for DMA_CH76_SHADR.
* To use register names with standard convension, please use DMA_CH76_SHADR.
*/
#define	DMA_SHADR076	(DMA_CH76_SHADR)

/** \\brief  29B0, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH77_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF00129B0u)

/** Alias (User Manual Name) for DMA_CH77_ADICR.
* To use register names with standard convension, please use DMA_CH77_ADICR.
*/
#define	DMA_ADICR077	(DMA_CH77_ADICR)

/** \\brief  29B4, DMA Channel Configuration Register */
#define DMA_CH77_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF00129B4u)

/** Alias (User Manual Name) for DMA_CH77_CHCFGR.
* To use register names with standard convension, please use DMA_CH77_CHCFGR.
*/
#define	DMA_CHCFGR077	(DMA_CH77_CHCFGR)

/** \\brief  29BC, DMARAM Channel Control and Status Register */
#define DMA_CH77_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF00129BCu)

/** Alias (User Manual Name) for DMA_CH77_CHCSR.
* To use register names with standard convension, please use DMA_CH77_CHCSR.
*/
#define	DMA_CHCSR077	(DMA_CH77_CHCSR)

/** \\brief  29AC, DMA Channel Destination Address Register x */
#define DMA_CH77_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF00129ACu)

/** Alias (User Manual Name) for DMA_CH77_DADR.
* To use register names with standard convension, please use DMA_CH77_DADR.
*/
#define	DMA_DADR077	(DMA_CH77_DADR)

/** \\brief  29A0, DMA Channel Read Data CRC Register */
#define DMA_CH77_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF00129A0u)

/** Alias (User Manual Name) for DMA_CH77_RDCRCR.
* To use register names with standard convension, please use DMA_CH77_RDCRCR.
*/
#define	DMA_RDCRCR077	(DMA_CH77_RDCRCR)

/** \\brief  29A8, DMA Channel Source Address Register */
#define DMA_CH77_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF00129A8u)

/** Alias (User Manual Name) for DMA_CH77_SADR.
* To use register names with standard convension, please use DMA_CH77_SADR.
*/
#define	DMA_SADR077	(DMA_CH77_SADR)

/** \\brief  29A4, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH77_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF00129A4u)

/** Alias (User Manual Name) for DMA_CH77_SDCRCR.
* To use register names with standard convension, please use DMA_CH77_SDCRCR.
*/
#define	DMA_SDCRCR077	(DMA_CH77_SDCRCR)

/** \\brief  29B8, DMA Channel Shadow Address Register */
#define DMA_CH77_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF00129B8u)

