HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxDma_reg.h
/** Alias (User Manual Name) for DMA_CH7_CHCSR.
* To use register names with standard convension, please use DMA_CH7_CHCSR.
*/
#define	DMA_CHCSR007	(DMA_CH7_CHCSR)

/** \\brief  20EC, DMA Channel Destination Address Register x */
#define DMA_CH7_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF00120ECu)

/** Alias (User Manual Name) for DMA_CH7_DADR.
* To use register names with standard convension, please use DMA_CH7_DADR.
*/
#define	DMA_DADR007	(DMA_CH7_DADR)

/** \\brief  20E0, DMA Channel Read Data CRC Register */
#define DMA_CH7_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF00120E0u)

/** Alias (User Manual Name) for DMA_CH7_RDCRCR.
* To use register names with standard convension, please use DMA_CH7_RDCRCR.
*/
#define	DMA_RDCRCR007	(DMA_CH7_RDCRCR)

/** \\brief  20E8, DMA Channel Source Address Register */
#define DMA_CH7_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF00120E8u)

/** Alias (User Manual Name) for DMA_CH7_SADR.
* To use register names with standard convension, please use DMA_CH7_SADR.
*/
#define	DMA_SADR007	(DMA_CH7_SADR)

/** \\brief  20E4, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH7_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF00120E4u)

/** Alias (User Manual Name) for DMA_CH7_SDCRCR.
* To use register names with standard convension, please use DMA_CH7_SDCRCR.
*/
#define	DMA_SDCRCR007	(DMA_CH7_SDCRCR)

/** \\brief  20F8, DMA Channel Shadow Address Register */
#define DMA_CH7_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF00120F8u)

/** Alias (User Manual Name) for DMA_CH7_SHADR.
* To use register names with standard convension, please use DMA_CH7_SHADR.
*/
#define	DMA_SHADR007	(DMA_CH7_SHADR)

/** \\brief  2A10, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH80_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012A10u)

/** Alias (User Manual Name) for DMA_CH80_ADICR.
* To use register names with standard convension, please use DMA_CH80_ADICR.
*/
#define	DMA_ADICR080	(DMA_CH80_ADICR)

/** \\brief  2A14, DMA Channel Configuration Register */
#define DMA_CH80_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012A14u)

/** Alias (User Manual Name) for DMA_CH80_CHCFGR.
* To use register names with standard convension, please use DMA_CH80_CHCFGR.
*/
#define	DMA_CHCFGR080	(DMA_CH80_CHCFGR)

/** \\brief  2A1C, DMARAM Channel Control and Status Register */
#define DMA_CH80_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012A1Cu)

/** Alias (User Manual Name) for DMA_CH80_CHCSR.
* To use register names with standard convension, please use DMA_CH80_CHCSR.
*/
#define	DMA_CHCSR080	(DMA_CH80_CHCSR)

/** \\brief  2A0C, DMA Channel Destination Address Register x */
#define DMA_CH80_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012A0Cu)

/** Alias (User Manual Name) for DMA_CH80_DADR.
* To use register names with standard convension, please use DMA_CH80_DADR.
*/
#define	DMA_DADR080	(DMA_CH80_DADR)

/** \\brief  2A00, DMA Channel Read Data CRC Register */
#define DMA_CH80_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012A00u)

/** Alias (User Manual Name) for DMA_CH80_RDCRCR.
* To use register names with standard convension, please use DMA_CH80_RDCRCR.
*/
#define	DMA_RDCRCR080	(DMA_CH80_RDCRCR)

/** \\brief  2A08, DMA Channel Source Address Register */
#define DMA_CH80_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012A08u)

/** Alias (User Manual Name) for DMA_CH80_SADR.
* To use register names with standard convension, please use DMA_CH80_SADR.
*/
#define	DMA_SADR080	(DMA_CH80_SADR)

/** \\brief  2A04, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH80_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012A04u)

/** Alias (User Manual Name) for DMA_CH80_SDCRCR.
* To use register names with standard convension, please use DMA_CH80_SDCRCR.
*/
#define	DMA_SDCRCR080	(DMA_CH80_SDCRCR)

/** \\brief  2A18, DMA Channel Shadow Address Register */
#define DMA_CH80_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012A18u)

/** Alias (User Manual Name) for DMA_CH80_SHADR.
* To use register names with standard convension, please use DMA_CH80_SHADR.
*/
#define	DMA_SHADR080	(DMA_CH80_SHADR)

/** \\brief  2A30, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH81_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012A30u)

/** Alias (User Manual Name) for DMA_CH81_ADICR.
* To use register names with standard convension, please use DMA_CH81_ADICR.
*/
#define	DMA_ADICR081	(DMA_CH81_ADICR)

/** \\brief  2A34, DMA Channel Configuration Register */
#define DMA_CH81_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012A34u)

/** Alias (User Manual Name) for DMA_CH81_CHCFGR.
* To use register names with standard convension, please use DMA_CH81_CHCFGR.
*/
#define	DMA_CHCFGR081	(DMA_CH81_CHCFGR)

/** \\brief  2A3C, DMARAM Channel Control and Status Register */
#define DMA_CH81_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012A3Cu)

/** Alias (User Manual Name) for DMA_CH81_CHCSR.
* To use register names with standard convension, please use DMA_CH81_CHCSR.
*/
#define	DMA_CHCSR081	(DMA_CH81_CHCSR)

/** \\brief  2A2C, DMA Channel Destination Address Register x */
#define DMA_CH81_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012A2Cu)

/** Alias (User Manual Name) for DMA_CH81_DADR.
* To use register names with standard convension, please use DMA_CH81_DADR.
*/
#define	DMA_DADR081	(DMA_CH81_DADR)

/** \\brief  2A20, DMA Channel Read Data CRC Register */
#define DMA_CH81_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012A20u)

/** Alias (User Manual Name) for DMA_CH81_RDCRCR.
* To use register names with standard convension, please use DMA_CH81_RDCRCR.
*/
#define	DMA_RDCRCR081	(DMA_CH81_RDCRCR)

/** \\brief  2A28, DMA Channel Source Address Register */
#define DMA_CH81_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012A28u)

/** Alias (User Manual Name) for DMA_CH81_SADR.
* To use register names with standard convension, please use DMA_CH81_SADR.
*/
#define	DMA_SADR081	(DMA_CH81_SADR)

/** \\brief  2A24, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH81_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012A24u)

/** Alias (User Manual Name) for DMA_CH81_SDCRCR.
* To use register names with standard convension, please use DMA_CH81_SDCRCR.
*/
#define	DMA_SDCRCR081	(DMA_CH81_SDCRCR)

/** \\brief  2A38, DMA Channel Shadow Address Register */
#define DMA_CH81_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012A38u)

/** Alias (User Manual Name) for DMA_CH81_SHADR.
* To use register names with standard convension, please use DMA_CH81_SHADR.
*/
#define	DMA_SHADR081	(DMA_CH81_SHADR)

/** \\brief  2A50, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH82_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012A50u)

/** Alias (User Manual Name) for DMA_CH82_ADICR.
* To use register names with standard convension, please use DMA_CH82_ADICR.
*/
#define	DMA_ADICR082	(DMA_CH82_ADICR)

/** \\brief  2A54, DMA Channel Configuration Register */
#define DMA_CH82_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012A54u)

/** Alias (User Manual Name) for DMA_CH82_CHCFGR.
* To use register names with standard convension, please use DMA_CH82_CHCFGR.
*/
#define	DMA_CHCFGR082	(DMA_CH82_CHCFGR)

/** \\brief  2A5C, DMARAM Channel Control and Status Register */
#define DMA_CH82_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012A5Cu)

