HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxDma_reg.h
/** Alias (User Manual Name) for DMA_CH82_CHCSR.
* To use register names with standard convension, please use DMA_CH82_CHCSR.
*/
#define	DMA_CHCSR082	(DMA_CH82_CHCSR)

/** \\brief  2A4C, DMA Channel Destination Address Register x */
#define DMA_CH82_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012A4Cu)

/** Alias (User Manual Name) for DMA_CH82_DADR.
* To use register names with standard convension, please use DMA_CH82_DADR.
*/
#define	DMA_DADR082	(DMA_CH82_DADR)

/** \\brief  2A40, DMA Channel Read Data CRC Register */
#define DMA_CH82_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012A40u)

/** Alias (User Manual Name) for DMA_CH82_RDCRCR.
* To use register names with standard convension, please use DMA_CH82_RDCRCR.
*/
#define	DMA_RDCRCR082	(DMA_CH82_RDCRCR)

/** \\brief  2A48, DMA Channel Source Address Register */
#define DMA_CH82_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012A48u)

/** Alias (User Manual Name) for DMA_CH82_SADR.
* To use register names with standard convension, please use DMA_CH82_SADR.
*/
#define	DMA_SADR082	(DMA_CH82_SADR)

/** \\brief  2A44, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH82_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012A44u)

/** Alias (User Manual Name) for DMA_CH82_SDCRCR.
* To use register names with standard convension, please use DMA_CH82_SDCRCR.
*/
#define	DMA_SDCRCR082	(DMA_CH82_SDCRCR)

/** \\brief  2A58, DMA Channel Shadow Address Register */
#define DMA_CH82_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012A58u)

/** Alias (User Manual Name) for DMA_CH82_SHADR.
* To use register names with standard convension, please use DMA_CH82_SHADR.
*/
#define	DMA_SHADR082	(DMA_CH82_SHADR)

/** \\brief  2A70, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH83_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012A70u)

/** Alias (User Manual Name) for DMA_CH83_ADICR.
* To use register names with standard convension, please use DMA_CH83_ADICR.
*/
#define	DMA_ADICR083	(DMA_CH83_ADICR)

/** \\brief  2A74, DMA Channel Configuration Register */
#define DMA_CH83_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012A74u)

/** Alias (User Manual Name) for DMA_CH83_CHCFGR.
* To use register names with standard convension, please use DMA_CH83_CHCFGR.
*/
#define	DMA_CHCFGR083	(DMA_CH83_CHCFGR)

/** \\brief  2A7C, DMARAM Channel Control and Status Register */
#define DMA_CH83_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012A7Cu)

/** Alias (User Manual Name) for DMA_CH83_CHCSR.
* To use register names with standard convension, please use DMA_CH83_CHCSR.
*/
#define	DMA_CHCSR083	(DMA_CH83_CHCSR)

/** \\brief  2A6C, DMA Channel Destination Address Register x */
#define DMA_CH83_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012A6Cu)

/** Alias (User Manual Name) for DMA_CH83_DADR.
* To use register names with standard convension, please use DMA_CH83_DADR.
*/
#define	DMA_DADR083	(DMA_CH83_DADR)

/** \\brief  2A60, DMA Channel Read Data CRC Register */
#define DMA_CH83_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012A60u)

/** Alias (User Manual Name) for DMA_CH83_RDCRCR.
* To use register names with standard convension, please use DMA_CH83_RDCRCR.
*/
#define	DMA_RDCRCR083	(DMA_CH83_RDCRCR)

/** \\brief  2A68, DMA Channel Source Address Register */
#define DMA_CH83_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012A68u)

/** Alias (User Manual Name) for DMA_CH83_SADR.
* To use register names with standard convension, please use DMA_CH83_SADR.
*/
#define	DMA_SADR083	(DMA_CH83_SADR)

/** \\brief  2A64, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH83_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012A64u)

/** Alias (User Manual Name) for DMA_CH83_SDCRCR.
* To use register names with standard convension, please use DMA_CH83_SDCRCR.
*/
#define	DMA_SDCRCR083	(DMA_CH83_SDCRCR)

/** \\brief  2A78, DMA Channel Shadow Address Register */
#define DMA_CH83_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012A78u)

/** Alias (User Manual Name) for DMA_CH83_SHADR.
* To use register names with standard convension, please use DMA_CH83_SHADR.
*/
#define	DMA_SHADR083	(DMA_CH83_SHADR)

/** \\brief  2A90, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH84_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012A90u)

/** Alias (User Manual Name) for DMA_CH84_ADICR.
* To use register names with standard convension, please use DMA_CH84_ADICR.
*/
#define	DMA_ADICR084	(DMA_CH84_ADICR)

/** \\brief  2A94, DMA Channel Configuration Register */
#define DMA_CH84_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012A94u)

/** Alias (User Manual Name) for DMA_CH84_CHCFGR.
* To use register names with standard convension, please use DMA_CH84_CHCFGR.
*/
#define	DMA_CHCFGR084	(DMA_CH84_CHCFGR)

/** \\brief  2A9C, DMARAM Channel Control and Status Register */
#define DMA_CH84_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012A9Cu)

/** Alias (User Manual Name) for DMA_CH84_CHCSR.
* To use register names with standard convension, please use DMA_CH84_CHCSR.
*/
#define	DMA_CHCSR084	(DMA_CH84_CHCSR)

/** \\brief  2A8C, DMA Channel Destination Address Register x */
#define DMA_CH84_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012A8Cu)

/** Alias (User Manual Name) for DMA_CH84_DADR.
* To use register names with standard convension, please use DMA_CH84_DADR.
*/
#define	DMA_DADR084	(DMA_CH84_DADR)

/** \\brief  2A80, DMA Channel Read Data CRC Register */
#define DMA_CH84_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012A80u)

/** Alias (User Manual Name) for DMA_CH84_RDCRCR.
* To use register names with standard convension, please use DMA_CH84_RDCRCR.
*/
#define	DMA_RDCRCR084	(DMA_CH84_RDCRCR)

/** \\brief  2A88, DMA Channel Source Address Register */
#define DMA_CH84_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012A88u)

/** Alias (User Manual Name) for DMA_CH84_SADR.
* To use register names with standard convension, please use DMA_CH84_SADR.
*/
#define	DMA_SADR084	(DMA_CH84_SADR)

