HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxDma_reg.h
/** \\brief  2AF4, DMA Channel Configuration Register */
#define DMA_CH87_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012AF4u)

/** Alias (User Manual Name) for DMA_CH87_CHCFGR.
* To use register names with standard convension, please use DMA_CH87_CHCFGR.
*/
#define	DMA_CHCFGR087	(DMA_CH87_CHCFGR)

/** \\brief  2AFC, DMARAM Channel Control and Status Register */
#define DMA_CH87_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012AFCu)

/** Alias (User Manual Name) for DMA_CH87_CHCSR.
* To use register names with standard convension, please use DMA_CH87_CHCSR.
*/
#define	DMA_CHCSR087	(DMA_CH87_CHCSR)

/** \\brief  2AEC, DMA Channel Destination Address Register x */
#define DMA_CH87_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012AECu)

/** Alias (User Manual Name) for DMA_CH87_DADR.
* To use register names with standard convension, please use DMA_CH87_DADR.
*/
#define	DMA_DADR087	(DMA_CH87_DADR)

/** \\brief  2AE0, DMA Channel Read Data CRC Register */
#define DMA_CH87_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012AE0u)

/** Alias (User Manual Name) for DMA_CH87_RDCRCR.
* To use register names with standard convension, please use DMA_CH87_RDCRCR.
*/
#define	DMA_RDCRCR087	(DMA_CH87_RDCRCR)

/** \\brief  2AE8, DMA Channel Source Address Register */
#define DMA_CH87_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012AE8u)

/** Alias (User Manual Name) for DMA_CH87_SADR.
* To use register names with standard convension, please use DMA_CH87_SADR.
*/
#define	DMA_SADR087	(DMA_CH87_SADR)

/** \\brief  2AE4, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH87_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012AE4u)

/** Alias (User Manual Name) for DMA_CH87_SDCRCR.
* To use register names with standard convension, please use DMA_CH87_SDCRCR.
*/
#define	DMA_SDCRCR087	(DMA_CH87_SDCRCR)

/** \\brief  2AF8, DMA Channel Shadow Address Register */
#define DMA_CH87_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012AF8u)

/** Alias (User Manual Name) for DMA_CH87_SHADR.
* To use register names with standard convension, please use DMA_CH87_SHADR.
*/
#define	DMA_SHADR087	(DMA_CH87_SHADR)

/** \\brief  2B10, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH88_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012B10u)

/** Alias (User Manual Name) for DMA_CH88_ADICR.
* To use register names with standard convension, please use DMA_CH88_ADICR.
*/
#define	DMA_ADICR088	(DMA_CH88_ADICR)

/** \\brief  2B14, DMA Channel Configuration Register */
#define DMA_CH88_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012B14u)

/** Alias (User Manual Name) for DMA_CH88_CHCFGR.
* To use register names with standard convension, please use DMA_CH88_CHCFGR.
*/
#define	DMA_CHCFGR088	(DMA_CH88_CHCFGR)

/** \\brief  2B1C, DMARAM Channel Control and Status Register */
#define DMA_CH88_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012B1Cu)

/** Alias (User Manual Name) for DMA_CH88_CHCSR.
* To use register names with standard convension, please use DMA_CH88_CHCSR.
*/
#define	DMA_CHCSR088	(DMA_CH88_CHCSR)

/** \\brief  2B0C, DMA Channel Destination Address Register x */
#define DMA_CH88_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012B0Cu)

/** Alias (User Manual Name) for DMA_CH88_DADR.
* To use register names with standard convension, please use DMA_CH88_DADR.
*/
#define	DMA_DADR088	(DMA_CH88_DADR)

/** \\brief  2B00, DMA Channel Read Data CRC Register */
#define DMA_CH88_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012B00u)

/** Alias (User Manual Name) for DMA_CH88_RDCRCR.
* To use register names with standard convension, please use DMA_CH88_RDCRCR.
*/
#define	DMA_RDCRCR088	(DMA_CH88_RDCRCR)

/** \\brief  2B08, DMA Channel Source Address Register */
#define DMA_CH88_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012B08u)

/** Alias (User Manual Name) for DMA_CH88_SADR.
* To use register names with standard convension, please use DMA_CH88_SADR.
*/
#define	DMA_SADR088	(DMA_CH88_SADR)

/** \\brief  2B04, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH88_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012B04u)

/** Alias (User Manual Name) for DMA_CH88_SDCRCR.
* To use register names with standard convension, please use DMA_CH88_SDCRCR.
*/
#define	DMA_SDCRCR088	(DMA_CH88_SDCRCR)

/** \\brief  2B18, DMA Channel Shadow Address Register */
#define DMA_CH88_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012B18u)

/** Alias (User Manual Name) for DMA_CH88_SHADR.
* To use register names with standard convension, please use DMA_CH88_SHADR.
*/
#define	DMA_SHADR088	(DMA_CH88_SHADR)

/** \\brief  2B30, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH89_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012B30u)

/** Alias (User Manual Name) for DMA_CH89_ADICR.
* To use register names with standard convension, please use DMA_CH89_ADICR.
*/
#define	DMA_ADICR089	(DMA_CH89_ADICR)

/** \\brief  2B34, DMA Channel Configuration Register */
#define DMA_CH89_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012B34u)

/** Alias (User Manual Name) for DMA_CH89_CHCFGR.
* To use register names with standard convension, please use DMA_CH89_CHCFGR.
*/
#define	DMA_CHCFGR089	(DMA_CH89_CHCFGR)

/** \\brief  2B3C, DMARAM Channel Control and Status Register */
#define DMA_CH89_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012B3Cu)

/** Alias (User Manual Name) for DMA_CH89_CHCSR.
* To use register names with standard convension, please use DMA_CH89_CHCSR.
*/
#define	DMA_CHCSR089	(DMA_CH89_CHCSR)

/** \\brief  2B2C, DMA Channel Destination Address Register x */
#define DMA_CH89_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012B2Cu)

/** Alias (User Manual Name) for DMA_CH89_DADR.
* To use register names with standard convension, please use DMA_CH89_DADR.
*/
#define	DMA_DADR089	(DMA_CH89_DADR)

