HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxDma_reg.h
/** \\brief  2B20, DMA Channel Read Data CRC Register */
#define DMA_CH89_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012B20u)

/** Alias (User Manual Name) for DMA_CH89_RDCRCR.
* To use register names with standard convension, please use DMA_CH89_RDCRCR.
*/
#define	DMA_RDCRCR089	(DMA_CH89_RDCRCR)

/** \\brief  2B28, DMA Channel Source Address Register */
#define DMA_CH89_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012B28u)

/** Alias (User Manual Name) for DMA_CH89_SADR.
* To use register names with standard convension, please use DMA_CH89_SADR.
*/
#define	DMA_SADR089	(DMA_CH89_SADR)

/** \\brief  2B24, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH89_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012B24u)

/** Alias (User Manual Name) for DMA_CH89_SDCRCR.
* To use register names with standard convension, please use DMA_CH89_SDCRCR.
*/
#define	DMA_SDCRCR089	(DMA_CH89_SDCRCR)

/** \\brief  2B38, DMA Channel Shadow Address Register */
#define DMA_CH89_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012B38u)

/** Alias (User Manual Name) for DMA_CH89_SHADR.
* To use register names with standard convension, please use DMA_CH89_SHADR.
*/
#define	DMA_SHADR089	(DMA_CH89_SHADR)

/** \\brief  2110, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH8_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012110u)

/** Alias (User Manual Name) for DMA_CH8_ADICR.
* To use register names with standard convension, please use DMA_CH8_ADICR.
*/
#define	DMA_ADICR008	(DMA_CH8_ADICR)

/** \\brief  2114, DMA Channel Configuration Register */
#define DMA_CH8_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012114u)

/** Alias (User Manual Name) for DMA_CH8_CHCFGR.
* To use register names with standard convension, please use DMA_CH8_CHCFGR.
*/
#define	DMA_CHCFGR008	(DMA_CH8_CHCFGR)

/** \\brief  211C, DMARAM Channel Control and Status Register */
#define DMA_CH8_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF001211Cu)

/** Alias (User Manual Name) for DMA_CH8_CHCSR.
* To use register names with standard convension, please use DMA_CH8_CHCSR.
*/
#define	DMA_CHCSR008	(DMA_CH8_CHCSR)

/** \\brief  210C, DMA Channel Destination Address Register x */
#define DMA_CH8_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF001210Cu)

/** Alias (User Manual Name) for DMA_CH8_DADR.
* To use register names with standard convension, please use DMA_CH8_DADR.
*/
#define	DMA_DADR008	(DMA_CH8_DADR)

/** \\brief  2100, DMA Channel Read Data CRC Register */
#define DMA_CH8_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012100u)

/** Alias (User Manual Name) for DMA_CH8_RDCRCR.
* To use register names with standard convension, please use DMA_CH8_RDCRCR.
*/
#define	DMA_RDCRCR008	(DMA_CH8_RDCRCR)

/** \\brief  2108, DMA Channel Source Address Register */
#define DMA_CH8_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012108u)

/** Alias (User Manual Name) for DMA_CH8_SADR.
* To use register names with standard convension, please use DMA_CH8_SADR.
*/
#define	DMA_SADR008	(DMA_CH8_SADR)

/** \\brief  2104, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH8_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012104u)

/** Alias (User Manual Name) for DMA_CH8_SDCRCR.
* To use register names with standard convension, please use DMA_CH8_SDCRCR.
*/
#define	DMA_SDCRCR008	(DMA_CH8_SDCRCR)

/** \\brief  2118, DMA Channel Shadow Address Register */
#define DMA_CH8_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012118u)

/** Alias (User Manual Name) for DMA_CH8_SHADR.
* To use register names with standard convension, please use DMA_CH8_SHADR.
*/
#define	DMA_SHADR008	(DMA_CH8_SHADR)

/** \\brief  2B50, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH90_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012B50u)

/** Alias (User Manual Name) for DMA_CH90_ADICR.
* To use register names with standard convension, please use DMA_CH90_ADICR.
*/
#define	DMA_ADICR090	(DMA_CH90_ADICR)

/** \\brief  2B54, DMA Channel Configuration Register */
#define DMA_CH90_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012B54u)

/** Alias (User Manual Name) for DMA_CH90_CHCFGR.
* To use register names with standard convension, please use DMA_CH90_CHCFGR.
*/
#define	DMA_CHCFGR090	(DMA_CH90_CHCFGR)

/** \\brief  2B5C, DMARAM Channel Control and Status Register */
#define DMA_CH90_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012B5Cu)

/** Alias (User Manual Name) for DMA_CH90_CHCSR.
* To use register names with standard convension, please use DMA_CH90_CHCSR.
*/
#define	DMA_CHCSR090	(DMA_CH90_CHCSR)

/** \\brief  2B4C, DMA Channel Destination Address Register x */
#define DMA_CH90_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012B4Cu)

/** Alias (User Manual Name) for DMA_CH90_DADR.
* To use register names with standard convension, please use DMA_CH90_DADR.
*/
#define	DMA_DADR090	(DMA_CH90_DADR)

/** \\brief  2B40, DMA Channel Read Data CRC Register */
#define DMA_CH90_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012B40u)

/** Alias (User Manual Name) for DMA_CH90_RDCRCR.
* To use register names with standard convension, please use DMA_CH90_RDCRCR.
*/
#define	DMA_RDCRCR090	(DMA_CH90_RDCRCR)

/** \\brief  2B48, DMA Channel Source Address Register */
#define DMA_CH90_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012B48u)

/** Alias (User Manual Name) for DMA_CH90_SADR.
* To use register names with standard convension, please use DMA_CH90_SADR.
*/
#define	DMA_SADR090	(DMA_CH90_SADR)

/** \\brief  2B44, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH90_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012B44u)

/** Alias (User Manual Name) for DMA_CH90_SDCRCR.
* To use register names with standard convension, please use DMA_CH90_SDCRCR.
*/
#define	DMA_SDCRCR090	(DMA_CH90_SDCRCR)

/** \\brief  2B58, DMA Channel Shadow Address Register */
#define DMA_CH90_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012B58u)

/** Alias (User Manual Name) for DMA_CH90_SHADR.
* To use register names with standard convension, please use DMA_CH90_SHADR.
*/
#define	DMA_SHADR090	(DMA_CH90_SHADR)

