HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxDma_reg.h
/** Alias (User Manual Name) for DMA_CH93_DADR.
* To use register names with standard convension, please use DMA_CH93_DADR.
*/
#define	DMA_DADR093	(DMA_CH93_DADR)

/** \\brief  2BA0, DMA Channel Read Data CRC Register */
#define DMA_CH93_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012BA0u)

/** Alias (User Manual Name) for DMA_CH93_RDCRCR.
* To use register names with standard convension, please use DMA_CH93_RDCRCR.
*/
#define	DMA_RDCRCR093	(DMA_CH93_RDCRCR)

/** \\brief  2BA8, DMA Channel Source Address Register */
#define DMA_CH93_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012BA8u)

/** Alias (User Manual Name) for DMA_CH93_SADR.
* To use register names with standard convension, please use DMA_CH93_SADR.
*/
#define	DMA_SADR093	(DMA_CH93_SADR)

/** \\brief  2BA4, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH93_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012BA4u)

/** Alias (User Manual Name) for DMA_CH93_SDCRCR.
* To use register names with standard convension, please use DMA_CH93_SDCRCR.
*/
#define	DMA_SDCRCR093	(DMA_CH93_SDCRCR)

/** \\brief  2BB8, DMA Channel Shadow Address Register */
#define DMA_CH93_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012BB8u)

/** Alias (User Manual Name) for DMA_CH93_SHADR.
* To use register names with standard convension, please use DMA_CH93_SHADR.
*/
#define	DMA_SHADR093	(DMA_CH93_SHADR)

/** \\brief  2BD0, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH94_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012BD0u)

/** Alias (User Manual Name) for DMA_CH94_ADICR.
* To use register names with standard convension, please use DMA_CH94_ADICR.
*/
#define	DMA_ADICR094	(DMA_CH94_ADICR)

/** \\brief  2BD4, DMA Channel Configuration Register */
#define DMA_CH94_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012BD4u)

/** Alias (User Manual Name) for DMA_CH94_CHCFGR.
* To use register names with standard convension, please use DMA_CH94_CHCFGR.
*/
#define	DMA_CHCFGR094	(DMA_CH94_CHCFGR)

/** \\brief  2BDC, DMARAM Channel Control and Status Register */
#define DMA_CH94_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012BDCu)

/** Alias (User Manual Name) for DMA_CH94_CHCSR.
* To use register names with standard convension, please use DMA_CH94_CHCSR.
*/
#define	DMA_CHCSR094	(DMA_CH94_CHCSR)

/** \\brief  2BCC, DMA Channel Destination Address Register x */
#define DMA_CH94_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012BCCu)

/** Alias (User Manual Name) for DMA_CH94_DADR.
* To use register names with standard convension, please use DMA_CH94_DADR.
*/
#define	DMA_DADR094	(DMA_CH94_DADR)

/** \\brief  2BC0, DMA Channel Read Data CRC Register */
#define DMA_CH94_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012BC0u)

/** Alias (User Manual Name) for DMA_CH94_RDCRCR.
* To use register names with standard convension, please use DMA_CH94_RDCRCR.
*/
#define	DMA_RDCRCR094	(DMA_CH94_RDCRCR)

/** \\brief  2BC8, DMA Channel Source Address Register */
#define DMA_CH94_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012BC8u)

/** Alias (User Manual Name) for DMA_CH94_SADR.
* To use register names with standard convension, please use DMA_CH94_SADR.
*/
#define	DMA_SADR094	(DMA_CH94_SADR)

/** \\brief  2BC4, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH94_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012BC4u)

/** Alias (User Manual Name) for DMA_CH94_SDCRCR.
* To use register names with standard convension, please use DMA_CH94_SDCRCR.
*/
#define	DMA_SDCRCR094	(DMA_CH94_SDCRCR)

/** \\brief  2BD8, DMA Channel Shadow Address Register */
#define DMA_CH94_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012BD8u)

/** Alias (User Manual Name) for DMA_CH94_SHADR.
* To use register names with standard convension, please use DMA_CH94_SHADR.
*/
#define	DMA_SHADR094	(DMA_CH94_SHADR)

/** \\brief  2BF0, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH95_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012BF0u)

/** Alias (User Manual Name) for DMA_CH95_ADICR.
* To use register names with standard convension, please use DMA_CH95_ADICR.
*/
#define	DMA_ADICR095	(DMA_CH95_ADICR)

/** \\brief  2BF4, DMA Channel Configuration Register */
#define DMA_CH95_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012BF4u)

/** Alias (User Manual Name) for DMA_CH95_CHCFGR.
* To use register names with standard convension, please use DMA_CH95_CHCFGR.
*/
#define	DMA_CHCFGR095	(DMA_CH95_CHCFGR)

/** \\brief  2BFC, DMARAM Channel Control and Status Register */
#define DMA_CH95_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012BFCu)

/** Alias (User Manual Name) for DMA_CH95_CHCSR.
* To use register names with standard convension, please use DMA_CH95_CHCSR.
*/
#define	DMA_CHCSR095	(DMA_CH95_CHCSR)

/** \\brief  2BEC, DMA Channel Destination Address Register x */
#define DMA_CH95_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012BECu)

/** Alias (User Manual Name) for DMA_CH95_DADR.
* To use register names with standard convension, please use DMA_CH95_DADR.
*/
#define	DMA_DADR095	(DMA_CH95_DADR)

/** \\brief  2BE0, DMA Channel Read Data CRC Register */
#define DMA_CH95_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012BE0u)

/** Alias (User Manual Name) for DMA_CH95_RDCRCR.
* To use register names with standard convension, please use DMA_CH95_RDCRCR.
*/
#define	DMA_RDCRCR095	(DMA_CH95_RDCRCR)

/** \\brief  2BE8, DMA Channel Source Address Register */
#define DMA_CH95_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012BE8u)

/** Alias (User Manual Name) for DMA_CH95_SADR.
* To use register names with standard convension, please use DMA_CH95_SADR.
*/
#define	DMA_SADR095	(DMA_CH95_SADR)

/** \\brief  2BE4, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH95_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012BE4u)

