HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxDma_reg.h
/** Alias (User Manual Name) for DMA_CH95_SDCRCR.
* To use register names with standard convension, please use DMA_CH95_SDCRCR.
*/
#define	DMA_SDCRCR095	(DMA_CH95_SDCRCR)

/** \\brief  2BF8, DMA Channel Shadow Address Register */
#define DMA_CH95_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012BF8u)

/** Alias (User Manual Name) for DMA_CH95_SHADR.
* To use register names with standard convension, please use DMA_CH95_SHADR.
*/
#define	DMA_SHADR095	(DMA_CH95_SHADR)

/** \\brief  2C10, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH96_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012C10u)

/** Alias (User Manual Name) for DMA_CH96_ADICR.
* To use register names with standard convension, please use DMA_CH96_ADICR.
*/
#define	DMA_ADICR096	(DMA_CH96_ADICR)

/** \\brief  2C14, DMA Channel Configuration Register */
#define DMA_CH96_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012C14u)

/** Alias (User Manual Name) for DMA_CH96_CHCFGR.
* To use register names with standard convension, please use DMA_CH96_CHCFGR.
*/
#define	DMA_CHCFGR096	(DMA_CH96_CHCFGR)

/** \\brief  2C1C, DMARAM Channel Control and Status Register */
#define DMA_CH96_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012C1Cu)

/** Alias (User Manual Name) for DMA_CH96_CHCSR.
* To use register names with standard convension, please use DMA_CH96_CHCSR.
*/
#define	DMA_CHCSR096	(DMA_CH96_CHCSR)

/** \\brief  2C0C, DMA Channel Destination Address Register x */
#define DMA_CH96_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012C0Cu)

/** Alias (User Manual Name) for DMA_CH96_DADR.
* To use register names with standard convension, please use DMA_CH96_DADR.
*/
#define	DMA_DADR096	(DMA_CH96_DADR)

/** \\brief  2C00, DMA Channel Read Data CRC Register */
#define DMA_CH96_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012C00u)

/** Alias (User Manual Name) for DMA_CH96_RDCRCR.
* To use register names with standard convension, please use DMA_CH96_RDCRCR.
*/
#define	DMA_RDCRCR096	(DMA_CH96_RDCRCR)

/** \\brief  2C08, DMA Channel Source Address Register */
#define DMA_CH96_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012C08u)

/** Alias (User Manual Name) for DMA_CH96_SADR.
* To use register names with standard convension, please use DMA_CH96_SADR.
*/
#define	DMA_SADR096	(DMA_CH96_SADR)

/** \\brief  2C04, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH96_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012C04u)

/** Alias (User Manual Name) for DMA_CH96_SDCRCR.
* To use register names with standard convension, please use DMA_CH96_SDCRCR.
*/
#define	DMA_SDCRCR096	(DMA_CH96_SDCRCR)

/** \\brief  2C18, DMA Channel Shadow Address Register */
#define DMA_CH96_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012C18u)

/** Alias (User Manual Name) for DMA_CH96_SHADR.
* To use register names with standard convension, please use DMA_CH96_SHADR.
*/
#define	DMA_SHADR096	(DMA_CH96_SHADR)

/** \\brief  2C30, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH97_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012C30u)

/** Alias (User Manual Name) for DMA_CH97_ADICR.
* To use register names with standard convension, please use DMA_CH97_ADICR.
*/
#define	DMA_ADICR097	(DMA_CH97_ADICR)

/** \\brief  2C34, DMA Channel Configuration Register */
#define DMA_CH97_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012C34u)

/** Alias (User Manual Name) for DMA_CH97_CHCFGR.
* To use register names with standard convension, please use DMA_CH97_CHCFGR.
*/
#define	DMA_CHCFGR097	(DMA_CH97_CHCFGR)

/** \\brief  2C3C, DMARAM Channel Control and Status Register */
#define DMA_CH97_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012C3Cu)

/** Alias (User Manual Name) for DMA_CH97_CHCSR.
* To use register names with standard convension, please use DMA_CH97_CHCSR.
*/
#define	DMA_CHCSR097	(DMA_CH97_CHCSR)

/** \\brief  2C2C, DMA Channel Destination Address Register x */
#define DMA_CH97_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012C2Cu)

/** Alias (User Manual Name) for DMA_CH97_DADR.
* To use register names with standard convension, please use DMA_CH97_DADR.
*/
#define	DMA_DADR097	(DMA_CH97_DADR)

/** \\brief  2C20, DMA Channel Read Data CRC Register */
#define DMA_CH97_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012C20u)

/** Alias (User Manual Name) for DMA_CH97_RDCRCR.
* To use register names with standard convension, please use DMA_CH97_RDCRCR.
*/
#define	DMA_RDCRCR097	(DMA_CH97_RDCRCR)

/** \\brief  2C28, DMA Channel Source Address Register */
#define DMA_CH97_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012C28u)

/** Alias (User Manual Name) for DMA_CH97_SADR.
* To use register names with standard convension, please use DMA_CH97_SADR.
*/
#define	DMA_SADR097	(DMA_CH97_SADR)

/** \\brief  2C24, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH97_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012C24u)

/** Alias (User Manual Name) for DMA_CH97_SDCRCR.
* To use register names with standard convension, please use DMA_CH97_SDCRCR.
*/
#define	DMA_SDCRCR097	(DMA_CH97_SDCRCR)

/** \\brief  2C38, DMA Channel Shadow Address Register */
#define DMA_CH97_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012C38u)

/** Alias (User Manual Name) for DMA_CH97_SHADR.
* To use register names with standard convension, please use DMA_CH97_SHADR.
*/
#define	DMA_SHADR097	(DMA_CH97_SHADR)

/** \\brief  2C50, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH98_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012C50u)

/** Alias (User Manual Name) for DMA_CH98_ADICR.
* To use register names with standard convension, please use DMA_CH98_ADICR.
*/
#define	DMA_ADICR098	(DMA_CH98_ADICR)

/** \\brief  2C54, DMA Channel Configuration Register */
#define DMA_CH98_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012C54u)

/** Alias (User Manual Name) for DMA_CH98_CHCFGR.
* To use register names with standard convension, please use DMA_CH98_CHCFGR.
*/
#define	DMA_CHCFGR098	(DMA_CH98_CHCFGR)

/** \\brief  2C5C, DMARAM Channel Control and Status Register */
#define DMA_CH98_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012C5Cu)

/** Alias (User Manual Name) for DMA_CH98_CHCSR.
* To use register names with standard convension, please use DMA_CH98_CHCSR.
*/
#define	DMA_CHCSR098	(DMA_CH98_CHCSR)

/** \\brief  2C4C, DMA Channel Destination Address Register x */
#define DMA_CH98_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012C4Cu)

/** Alias (User Manual Name) for DMA_CH98_DADR.
* To use register names with standard convension, please use DMA_CH98_DADR.
*/
#define	DMA_DADR098	(DMA_CH98_DADR)

/** \\brief  2C40, DMA Channel Read Data CRC Register */
#define DMA_CH98_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012C40u)

/** Alias (User Manual Name) for DMA_CH98_RDCRCR.
* To use register names with standard convension, please use DMA_CH98_RDCRCR.
*/
#define	DMA_RDCRCR098	(DMA_CH98_RDCRCR)

/** \\brief  2C48, DMA Channel Source Address Register */
#define DMA_CH98_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012C48u)

