HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxDma_reg.h
/** Alias (User Manual Name) for DMA_HRR79.
* To use register names with standard convension, please use DMA_HRR79.
*/
#define	DMA_HRR079	(DMA_HRR79)

/** \\brief  1820, DMA Channel Hardware Resource Register */
#define DMA_HRR8 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF0011820u)

/** Alias (User Manual Name) for DMA_HRR8.
* To use register names with standard convension, please use DMA_HRR8.
*/
#define	DMA_HRR008	(DMA_HRR8)

/** \\brief  1940, DMA Channel Hardware Resource Register */
#define DMA_HRR80 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF0011940u)

/** Alias (User Manual Name) for DMA_HRR80.
* To use register names with standard convension, please use DMA_HRR80.
*/
#define	DMA_HRR080	(DMA_HRR80)

/** \\brief  1944, DMA Channel Hardware Resource Register */
#define DMA_HRR81 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF0011944u)

/** Alias (User Manual Name) for DMA_HRR81.
* To use register names with standard convension, please use DMA_HRR81.
*/
#define	DMA_HRR081	(DMA_HRR81)

/** \\brief  1948, DMA Channel Hardware Resource Register */
#define DMA_HRR82 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF0011948u)

/** Alias (User Manual Name) for DMA_HRR82.
* To use register names with standard convension, please use DMA_HRR82.
*/
#define	DMA_HRR082	(DMA_HRR82)

/** \\brief  194C, DMA Channel Hardware Resource Register */
#define DMA_HRR83 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF001194Cu)

/** Alias (User Manual Name) for DMA_HRR83.
* To use register names with standard convension, please use DMA_HRR83.
*/
#define	DMA_HRR083	(DMA_HRR83)

/** \\brief  1950, DMA Channel Hardware Resource Register */
#define DMA_HRR84 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF0011950u)

/** Alias (User Manual Name) for DMA_HRR84.
* To use register names with standard convension, please use DMA_HRR84.
*/
#define	DMA_HRR084	(DMA_HRR84)

/** \\brief  1954, DMA Channel Hardware Resource Register */
#define DMA_HRR85 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF0011954u)

/** Alias (User Manual Name) for DMA_HRR85.
* To use register names with standard convension, please use DMA_HRR85.
*/
#define	DMA_HRR085	(DMA_HRR85)

/** \\brief  1958, DMA Channel Hardware Resource Register */
#define DMA_HRR86 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF0011958u)

/** Alias (User Manual Name) for DMA_HRR86.
* To use register names with standard convension, please use DMA_HRR86.
*/
#define	DMA_HRR086	(DMA_HRR86)

/** \\brief  195C, DMA Channel Hardware Resource Register */
#define DMA_HRR87 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF001195Cu)

/** Alias (User Manual Name) for DMA_HRR87.
* To use register names with standard convension, please use DMA_HRR87.
*/
#define	DMA_HRR087	(DMA_HRR87)

/** \\brief  1960, DMA Channel Hardware Resource Register */
#define DMA_HRR88 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF0011960u)

/** Alias (User Manual Name) for DMA_HRR88.
* To use register names with standard convension, please use DMA_HRR88.
*/
#define	DMA_HRR088	(DMA_HRR88)

/** \\brief  1964, DMA Channel Hardware Resource Register */
#define DMA_HRR89 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF0011964u)

/** Alias (User Manual Name) for DMA_HRR89.
* To use register names with standard convension, please use DMA_HRR89.
*/
#define	DMA_HRR089	(DMA_HRR89)

/** \\brief  1824, DMA Channel Hardware Resource Register */
#define DMA_HRR9 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF0011824u)

/** Alias (User Manual Name) for DMA_HRR9.
* To use register names with standard convension, please use DMA_HRR9.
*/
#define	DMA_HRR009	(DMA_HRR9)

/** \\brief  1968, DMA Channel Hardware Resource Register */
#define DMA_HRR90 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF0011968u)

/** Alias (User Manual Name) for DMA_HRR90.
* To use register names with standard convension, please use DMA_HRR90.
*/
#define	DMA_HRR090	(DMA_HRR90)

/** \\brief  196C, DMA Channel Hardware Resource Register */
#define DMA_HRR91 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF001196Cu)

/** Alias (User Manual Name) for DMA_HRR91.
* To use register names with standard convension, please use DMA_HRR91.
*/
#define	DMA_HRR091	(DMA_HRR91)

/** \\brief  1970, DMA Channel Hardware Resource Register */
#define DMA_HRR92 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF0011970u)

/** Alias (User Manual Name) for DMA_HRR92.
* To use register names with standard convension, please use DMA_HRR92.
*/
#define	DMA_HRR092	(DMA_HRR92)

/** \\brief  1974, DMA Channel Hardware Resource Register */
#define DMA_HRR93 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF0011974u)

/** Alias (User Manual Name) for DMA_HRR93.
* To use register names with standard convension, please use DMA_HRR93.
*/
#define	DMA_HRR093	(DMA_HRR93)

/** \\brief  1978, DMA Channel Hardware Resource Register */
#define DMA_HRR94 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF0011978u)

/** Alias (User Manual Name) for DMA_HRR94.
* To use register names with standard convension, please use DMA_HRR94.
*/
#define	DMA_HRR094	(DMA_HRR94)

/** \\brief  197C, DMA Channel Hardware Resource Register */
#define DMA_HRR95 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF001197Cu)

/** Alias (User Manual Name) for DMA_HRR95.
* To use register names with standard convension, please use DMA_HRR95.
*/
#define	DMA_HRR095	(DMA_HRR95)

/** \\brief  1980, DMA Channel Hardware Resource Register */
#define DMA_HRR96 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF0011980u)

/** Alias (User Manual Name) for DMA_HRR96.
* To use register names with standard convension, please use DMA_HRR96.
*/
#define	DMA_HRR096	(DMA_HRR96)

/** \\brief  1984, DMA Channel Hardware Resource Register */
#define DMA_HRR97 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF0011984u)

/** Alias (User Manual Name) for DMA_HRR97.
* To use register names with standard convension, please use DMA_HRR97.
*/
#define	DMA_HRR097	(DMA_HRR97)

/** \\brief  1988, DMA Channel Hardware Resource Register */
#define DMA_HRR98 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF0011988u)

/** Alias (User Manual Name) for DMA_HRR98.
* To use register names with standard convension, please use DMA_HRR98.
*/
#define	DMA_HRR098	(DMA_HRR98)

/** \\brief  198C, DMA Channel Hardware Resource Register */
#define DMA_HRR99 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF001198Cu)

/** Alias (User Manual Name) for DMA_HRR99.
* To use register names with standard convension, please use DMA_HRR99.
*/
#define	DMA_HRR099	(DMA_HRR99)

