HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxDma_reg.h
/** \\brief  8, Module Identification Register */
#define DMA_ID /*lint --e(923)*/ (*(volatile Ifx_DMA_ID*)0xF0010008u)

/** \\brief  20, DMA Memory Control Register */
#define DMA_MEMCON /*lint --e(923)*/ (*(volatile Ifx_DMA_MEMCON*)0xF0010020u)

/** \\brief  1300, DMA Mode Register */
#define DMA_MODE0 /*lint --e(923)*/ (*(volatile Ifx_DMA_MODE*)0xF0011300u)

/** \\brief  1304, DMA Mode Register */
#define DMA_MODE1 /*lint --e(923)*/ (*(volatile Ifx_DMA_MODE*)0xF0011304u)

/** \\brief  1308, DMA Mode Register */
#define DMA_MODE2 /*lint --e(923)*/ (*(volatile Ifx_DMA_MODE*)0xF0011308u)

/** \\brief  130C, DMA Mode Register */
#define DMA_MODE3 /*lint --e(923)*/ (*(volatile Ifx_DMA_MODE*)0xF001130Cu)

/** \\brief  1200, DMA OCDS Trigger Set Select */
#define DMA_OTSS /*lint --e(923)*/ (*(volatile Ifx_DMA_OTSS*)0xF0011200u)

/** \\brief  1208, Pattern Read Register 0 */
#define DMA_PRR0 /*lint --e(923)*/ (*(volatile Ifx_DMA_PRR0*)0xF0011208u)

/** \\brief  120C, Pattern Read Register 1 */
#define DMA_PRR1 /*lint --e(923)*/ (*(volatile Ifx_DMA_PRR1*)0xF001120Cu)

/** \\brief  1C00, DMA Suspend Acknowledge Register */
#define DMA_SUSACR0 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011C00u)

/** Alias (User Manual Name) for DMA_SUSACR0.
* To use register names with standard convension, please use DMA_SUSACR0.
*/
#define	DMA_SUSACR000	(DMA_SUSACR0)

/** \\brief  1C04, DMA Suspend Acknowledge Register */
#define DMA_SUSACR1 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011C04u)

/** Alias (User Manual Name) for DMA_SUSACR1.
* To use register names with standard convension, please use DMA_SUSACR1.
*/
#define	DMA_SUSACR001	(DMA_SUSACR1)

/** \\brief  1C28, DMA Suspend Acknowledge Register */
#define DMA_SUSACR10 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011C28u)

/** Alias (User Manual Name) for DMA_SUSACR10.
* To use register names with standard convension, please use DMA_SUSACR10.
*/
#define	DMA_SUSACR010	(DMA_SUSACR10)

/** \\brief  1D90, DMA Suspend Acknowledge Register */
#define DMA_SUSACR100 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D90u)

/** \\brief  1D94, DMA Suspend Acknowledge Register */
#define DMA_SUSACR101 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D94u)

/** \\brief  1D98, DMA Suspend Acknowledge Register */
#define DMA_SUSACR102 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D98u)

/** \\brief  1D9C, DMA Suspend Acknowledge Register */
#define DMA_SUSACR103 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D9Cu)

/** \\brief  1DA0, DMA Suspend Acknowledge Register */
#define DMA_SUSACR104 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011DA0u)

/** \\brief  1DA4, DMA Suspend Acknowledge Register */
#define DMA_SUSACR105 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011DA4u)

/** \\brief  1DA8, DMA Suspend Acknowledge Register */
#define DMA_SUSACR106 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011DA8u)

/** \\brief  1DAC, DMA Suspend Acknowledge Register */
#define DMA_SUSACR107 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011DACu)

/** \\brief  1DB0, DMA Suspend Acknowledge Register */
#define DMA_SUSACR108 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011DB0u)

/** \\brief  1DB4, DMA Suspend Acknowledge Register */
#define DMA_SUSACR109 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011DB4u)

/** \\brief  1C2C, DMA Suspend Acknowledge Register */
#define DMA_SUSACR11 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011C2Cu)

/** Alias (User Manual Name) for DMA_SUSACR11.
* To use register names with standard convension, please use DMA_SUSACR11.
*/
#define	DMA_SUSACR011	(DMA_SUSACR11)

/** \\brief  1DB8, DMA Suspend Acknowledge Register */
#define DMA_SUSACR110 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011DB8u)

/** \\brief  1DBC, DMA Suspend Acknowledge Register */
#define DMA_SUSACR111 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011DBCu)

/** \\brief  1DC0, DMA Suspend Acknowledge Register */
#define DMA_SUSACR112 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011DC0u)

/** \\brief  1DC4, DMA Suspend Acknowledge Register */
#define DMA_SUSACR113 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011DC4u)

/** \\brief  1DC8, DMA Suspend Acknowledge Register */
#define DMA_SUSACR114 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011DC8u)

/** \\brief  1DCC, DMA Suspend Acknowledge Register */
#define DMA_SUSACR115 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011DCCu)

/** \\brief  1DD0, DMA Suspend Acknowledge Register */
#define DMA_SUSACR116 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011DD0u)

/** \\brief  1DD4, DMA Suspend Acknowledge Register */
#define DMA_SUSACR117 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011DD4u)

/** \\brief  1DD8, DMA Suspend Acknowledge Register */
#define DMA_SUSACR118 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011DD8u)

/** \\brief  1DDC, DMA Suspend Acknowledge Register */
#define DMA_SUSACR119 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011DDCu)

/** \\brief  1C30, DMA Suspend Acknowledge Register */
#define DMA_SUSACR12 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011C30u)

/** Alias (User Manual Name) for DMA_SUSACR12.
* To use register names with standard convension, please use DMA_SUSACR12.
*/
#define	DMA_SUSACR012	(DMA_SUSACR12)

/** \\brief  1DE0, DMA Suspend Acknowledge Register */
#define DMA_SUSACR120 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011DE0u)

/** \\brief  1DE4, DMA Suspend Acknowledge Register */
#define DMA_SUSACR121 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011DE4u)

/** \\brief  1DE8, DMA Suspend Acknowledge Register */
#define DMA_SUSACR122 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011DE8u)

/** \\brief  1DEC, DMA Suspend Acknowledge Register */
#define DMA_SUSACR123 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011DECu)

/** \\brief  1DF0, DMA Suspend Acknowledge Register */
#define DMA_SUSACR124 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011DF0u)

/** \\brief  1DF4, DMA Suspend Acknowledge Register */
#define DMA_SUSACR125 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011DF4u)

