HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxDma_reg.h
/** Alias (User Manual Name) for DMA_SUSACR50.
* To use register names with standard convension, please use DMA_SUSACR50.
*/
#define	DMA_SUSACR050	(DMA_SUSACR50)

/** \\brief  1CCC, DMA Suspend Acknowledge Register */
#define DMA_SUSACR51 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011CCCu)

/** Alias (User Manual Name) for DMA_SUSACR51.
* To use register names with standard convension, please use DMA_SUSACR51.
*/
#define	DMA_SUSACR051	(DMA_SUSACR51)

/** \\brief  1CD0, DMA Suspend Acknowledge Register */
#define DMA_SUSACR52 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011CD0u)

/** Alias (User Manual Name) for DMA_SUSACR52.
* To use register names with standard convension, please use DMA_SUSACR52.
*/
#define	DMA_SUSACR052	(DMA_SUSACR52)

/** \\brief  1CD4, DMA Suspend Acknowledge Register */
#define DMA_SUSACR53 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011CD4u)

/** Alias (User Manual Name) for DMA_SUSACR53.
* To use register names with standard convension, please use DMA_SUSACR53.
*/
#define	DMA_SUSACR053	(DMA_SUSACR53)

/** \\brief  1CD8, DMA Suspend Acknowledge Register */
#define DMA_SUSACR54 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011CD8u)

/** Alias (User Manual Name) for DMA_SUSACR54.
* To use register names with standard convension, please use DMA_SUSACR54.
*/
#define	DMA_SUSACR054	(DMA_SUSACR54)

/** \\brief  1CDC, DMA Suspend Acknowledge Register */
#define DMA_SUSACR55 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011CDCu)

/** Alias (User Manual Name) for DMA_SUSACR55.
* To use register names with standard convension, please use DMA_SUSACR55.
*/
#define	DMA_SUSACR055	(DMA_SUSACR55)

/** \\brief  1CE0, DMA Suspend Acknowledge Register */
#define DMA_SUSACR56 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011CE0u)

/** Alias (User Manual Name) for DMA_SUSACR56.
* To use register names with standard convension, please use DMA_SUSACR56.
*/
#define	DMA_SUSACR056	(DMA_SUSACR56)

/** \\brief  1CE4, DMA Suspend Acknowledge Register */
#define DMA_SUSACR57 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011CE4u)

/** Alias (User Manual Name) for DMA_SUSACR57.
* To use register names with standard convension, please use DMA_SUSACR57.
*/
#define	DMA_SUSACR057	(DMA_SUSACR57)

/** \\brief  1CE8, DMA Suspend Acknowledge Register */
#define DMA_SUSACR58 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011CE8u)

/** Alias (User Manual Name) for DMA_SUSACR58.
* To use register names with standard convension, please use DMA_SUSACR58.
*/
#define	DMA_SUSACR058	(DMA_SUSACR58)

/** \\brief  1CEC, DMA Suspend Acknowledge Register */
#define DMA_SUSACR59 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011CECu)

/** Alias (User Manual Name) for DMA_SUSACR59.
* To use register names with standard convension, please use DMA_SUSACR59.
*/
#define	DMA_SUSACR059	(DMA_SUSACR59)

/** \\brief  1C18, DMA Suspend Acknowledge Register */
#define DMA_SUSACR6 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011C18u)

/** Alias (User Manual Name) for DMA_SUSACR6.
* To use register names with standard convension, please use DMA_SUSACR6.
*/
#define	DMA_SUSACR006	(DMA_SUSACR6)

/** \\brief  1CF0, DMA Suspend Acknowledge Register */
#define DMA_SUSACR60 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011CF0u)

/** Alias (User Manual Name) for DMA_SUSACR60.
* To use register names with standard convension, please use DMA_SUSACR60.
*/
#define	DMA_SUSACR060	(DMA_SUSACR60)

/** \\brief  1CF4, DMA Suspend Acknowledge Register */
#define DMA_SUSACR61 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011CF4u)

/** Alias (User Manual Name) for DMA_SUSACR61.
* To use register names with standard convension, please use DMA_SUSACR61.
*/
#define	DMA_SUSACR061	(DMA_SUSACR61)

/** \\brief  1CF8, DMA Suspend Acknowledge Register */
#define DMA_SUSACR62 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011CF8u)

/** Alias (User Manual Name) for DMA_SUSACR62.
* To use register names with standard convension, please use DMA_SUSACR62.
*/
#define	DMA_SUSACR062	(DMA_SUSACR62)

/** \\brief  1CFC, DMA Suspend Acknowledge Register */
#define DMA_SUSACR63 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011CFCu)

/** Alias (User Manual Name) for DMA_SUSACR63.
* To use register names with standard convension, please use DMA_SUSACR63.
*/
#define	DMA_SUSACR063	(DMA_SUSACR63)

/** \\brief  1D00, DMA Suspend Acknowledge Register */
#define DMA_SUSACR64 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D00u)

/** Alias (User Manual Name) for DMA_SUSACR64.
* To use register names with standard convension, please use DMA_SUSACR64.
*/
#define	DMA_SUSACR064	(DMA_SUSACR64)

/** \\brief  1D04, DMA Suspend Acknowledge Register */
#define DMA_SUSACR65 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D04u)

/** Alias (User Manual Name) for DMA_SUSACR65.
* To use register names with standard convension, please use DMA_SUSACR65.
*/
#define	DMA_SUSACR065	(DMA_SUSACR65)

/** \\brief  1D08, DMA Suspend Acknowledge Register */
#define DMA_SUSACR66 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D08u)

/** Alias (User Manual Name) for DMA_SUSACR66.
* To use register names with standard convension, please use DMA_SUSACR66.
*/
#define	DMA_SUSACR066	(DMA_SUSACR66)

/** \\brief  1D0C, DMA Suspend Acknowledge Register */
#define DMA_SUSACR67 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D0Cu)

/** Alias (User Manual Name) for DMA_SUSACR67.
* To use register names with standard convension, please use DMA_SUSACR67.
*/
#define	DMA_SUSACR067	(DMA_SUSACR67)

/** \\brief  1D10, DMA Suspend Acknowledge Register */
#define DMA_SUSACR68 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D10u)

/** Alias (User Manual Name) for DMA_SUSACR68.
* To use register names with standard convension, please use DMA_SUSACR68.
*/
#define	DMA_SUSACR068	(DMA_SUSACR68)

/** \\brief  1D14, DMA Suspend Acknowledge Register */
#define DMA_SUSACR69 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D14u)

/** Alias (User Manual Name) for DMA_SUSACR69.
* To use register names with standard convension, please use DMA_SUSACR69.
*/
#define	DMA_SUSACR069	(DMA_SUSACR69)

/** \\brief  1C1C, DMA Suspend Acknowledge Register */
#define DMA_SUSACR7 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011C1Cu)

/** Alias (User Manual Name) for DMA_SUSACR7.
* To use register names with standard convension, please use DMA_SUSACR7.
*/
#define	DMA_SUSACR007	(DMA_SUSACR7)

