HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxDma_reg.h
/** Alias (User Manual Name) for DMA_SUSACR90.
* To use register names with standard convension, please use DMA_SUSACR90.
*/
#define	DMA_SUSACR090	(DMA_SUSACR90)

/** \\brief  1D6C, DMA Suspend Acknowledge Register */
#define DMA_SUSACR91 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D6Cu)

/** Alias (User Manual Name) for DMA_SUSACR91.
* To use register names with standard convension, please use DMA_SUSACR91.
*/
#define	DMA_SUSACR091	(DMA_SUSACR91)

/** \\brief  1D70, DMA Suspend Acknowledge Register */
#define DMA_SUSACR92 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D70u)

/** Alias (User Manual Name) for DMA_SUSACR92.
* To use register names with standard convension, please use DMA_SUSACR92.
*/
#define	DMA_SUSACR092	(DMA_SUSACR92)

/** \\brief  1D74, DMA Suspend Acknowledge Register */
#define DMA_SUSACR93 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D74u)

/** Alias (User Manual Name) for DMA_SUSACR93.
* To use register names with standard convension, please use DMA_SUSACR93.
*/
#define	DMA_SUSACR093	(DMA_SUSACR93)

/** \\brief  1D78, DMA Suspend Acknowledge Register */
#define DMA_SUSACR94 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D78u)

/** Alias (User Manual Name) for DMA_SUSACR94.
* To use register names with standard convension, please use DMA_SUSACR94.
*/
#define	DMA_SUSACR094	(DMA_SUSACR94)

/** \\brief  1D7C, DMA Suspend Acknowledge Register */
#define DMA_SUSACR95 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D7Cu)

/** Alias (User Manual Name) for DMA_SUSACR95.
* To use register names with standard convension, please use DMA_SUSACR95.
*/
#define	DMA_SUSACR095	(DMA_SUSACR95)

/** \\brief  1D80, DMA Suspend Acknowledge Register */
#define DMA_SUSACR96 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D80u)

/** Alias (User Manual Name) for DMA_SUSACR96.
* To use register names with standard convension, please use DMA_SUSACR96.
*/
#define	DMA_SUSACR096	(DMA_SUSACR96)

/** \\brief  1D84, DMA Suspend Acknowledge Register */
#define DMA_SUSACR97 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D84u)

/** Alias (User Manual Name) for DMA_SUSACR97.
* To use register names with standard convension, please use DMA_SUSACR97.
*/
#define	DMA_SUSACR097	(DMA_SUSACR97)

/** \\brief  1D88, DMA Suspend Acknowledge Register */
#define DMA_SUSACR98 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D88u)

/** Alias (User Manual Name) for DMA_SUSACR98.
* To use register names with standard convension, please use DMA_SUSACR98.
*/
#define	DMA_SUSACR098	(DMA_SUSACR98)

/** \\brief  1D8C, DMA Suspend Acknowledge Register */
#define DMA_SUSACR99 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D8Cu)

/** Alias (User Manual Name) for DMA_SUSACR99.
* To use register names with standard convension, please use DMA_SUSACR99.
*/
#define	DMA_SUSACR099	(DMA_SUSACR99)

/** \\brief  1A00, DMA Suspend Enable Register */
#define DMA_SUSENR0 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011A00u)

/** Alias (User Manual Name) for DMA_SUSENR0.
* To use register names with standard convension, please use DMA_SUSENR0.
*/
#define	DMA_SUSENR000	(DMA_SUSENR0)

/** \\brief  1A04, DMA Suspend Enable Register */
#define DMA_SUSENR1 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011A04u)

/** Alias (User Manual Name) for DMA_SUSENR1.
* To use register names with standard convension, please use DMA_SUSENR1.
*/
#define	DMA_SUSENR001	(DMA_SUSENR1)

/** \\brief  1A28, DMA Suspend Enable Register */
#define DMA_SUSENR10 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011A28u)

/** Alias (User Manual Name) for DMA_SUSENR10.
* To use register names with standard convension, please use DMA_SUSENR10.
*/
#define	DMA_SUSENR010	(DMA_SUSENR10)

/** \\brief  1B90, DMA Suspend Enable Register */
#define DMA_SUSENR100 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B90u)

/** \\brief  1B94, DMA Suspend Enable Register */
#define DMA_SUSENR101 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B94u)

/** \\brief  1B98, DMA Suspend Enable Register */
#define DMA_SUSENR102 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B98u)

/** \\brief  1B9C, DMA Suspend Enable Register */
#define DMA_SUSENR103 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B9Cu)

/** \\brief  1BA0, DMA Suspend Enable Register */
#define DMA_SUSENR104 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011BA0u)

/** \\brief  1BA4, DMA Suspend Enable Register */
#define DMA_SUSENR105 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011BA4u)

/** \\brief  1BA8, DMA Suspend Enable Register */
#define DMA_SUSENR106 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011BA8u)

/** \\brief  1BAC, DMA Suspend Enable Register */
#define DMA_SUSENR107 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011BACu)

/** \\brief  1BB0, DMA Suspend Enable Register */
#define DMA_SUSENR108 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011BB0u)

/** \\brief  1BB4, DMA Suspend Enable Register */
#define DMA_SUSENR109 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011BB4u)

/** \\brief  1A2C, DMA Suspend Enable Register */
#define DMA_SUSENR11 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011A2Cu)

/** Alias (User Manual Name) for DMA_SUSENR11.
* To use register names with standard convension, please use DMA_SUSENR11.
*/
#define	DMA_SUSENR011	(DMA_SUSENR11)

/** \\brief  1BB8, DMA Suspend Enable Register */
#define DMA_SUSENR110 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011BB8u)

/** \\brief  1BBC, DMA Suspend Enable Register */
#define DMA_SUSENR111 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011BBCu)

/** \\brief  1BC0, DMA Suspend Enable Register */
#define DMA_SUSENR112 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011BC0u)

/** \\brief  1BC4, DMA Suspend Enable Register */
#define DMA_SUSENR113 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011BC4u)

/** \\brief  1BC8, DMA Suspend Enable Register */
#define DMA_SUSENR114 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011BC8u)

/** \\brief  1BCC, DMA Suspend Enable Register */
#define DMA_SUSENR115 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011BCCu)

/** \\brief  1BD0, DMA Suspend Enable Register */
#define DMA_SUSENR116 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011BD0u)

/** \\brief  1BD4, DMA Suspend Enable Register */
#define DMA_SUSENR117 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011BD4u)

/** \\brief  1BD8, DMA Suspend Enable Register */
#define DMA_SUSENR118 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011BD8u)

/** \\brief  1BDC, DMA Suspend Enable Register */
#define DMA_SUSENR119 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011BDCu)

/** \\brief  1A30, DMA Suspend Enable Register */
#define DMA_SUSENR12 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011A30u)

/** Alias (User Manual Name) for DMA_SUSENR12.
* To use register names with standard convension, please use DMA_SUSENR12.
*/
#define	DMA_SUSENR012	(DMA_SUSENR12)

/** \\brief  1BE0, DMA Suspend Enable Register */
#define DMA_SUSENR120 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011BE0u)

/** \\brief  1BE4, DMA Suspend Enable Register */
#define DMA_SUSENR121 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011BE4u)

