HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxDma_reg.h
/** Alias (User Manual Name) for DMA_SUSENR5.
* To use register names with standard convension, please use DMA_SUSENR5.
*/
#define	DMA_SUSENR005	(DMA_SUSENR5)

/** \\brief  1AC8, DMA Suspend Enable Register */
#define DMA_SUSENR50 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011AC8u)

/** Alias (User Manual Name) for DMA_SUSENR50.
* To use register names with standard convension, please use DMA_SUSENR50.
*/
#define	DMA_SUSENR050	(DMA_SUSENR50)

/** \\brief  1ACC, DMA Suspend Enable Register */
#define DMA_SUSENR51 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011ACCu)

/** Alias (User Manual Name) for DMA_SUSENR51.
* To use register names with standard convension, please use DMA_SUSENR51.
*/
#define	DMA_SUSENR051	(DMA_SUSENR51)

/** \\brief  1AD0, DMA Suspend Enable Register */
#define DMA_SUSENR52 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011AD0u)

/** Alias (User Manual Name) for DMA_SUSENR52.
* To use register names with standard convension, please use DMA_SUSENR52.
*/
#define	DMA_SUSENR052	(DMA_SUSENR52)

/** \\brief  1AD4, DMA Suspend Enable Register */
#define DMA_SUSENR53 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011AD4u)

/** Alias (User Manual Name) for DMA_SUSENR53.
* To use register names with standard convension, please use DMA_SUSENR53.
*/
#define	DMA_SUSENR053	(DMA_SUSENR53)

/** \\brief  1AD8, DMA Suspend Enable Register */
#define DMA_SUSENR54 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011AD8u)

/** Alias (User Manual Name) for DMA_SUSENR54.
* To use register names with standard convension, please use DMA_SUSENR54.
*/
#define	DMA_SUSENR054	(DMA_SUSENR54)

/** \\brief  1ADC, DMA Suspend Enable Register */
#define DMA_SUSENR55 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011ADCu)

/** Alias (User Manual Name) for DMA_SUSENR55.
* To use register names with standard convension, please use DMA_SUSENR55.
*/
#define	DMA_SUSENR055	(DMA_SUSENR55)

/** \\brief  1AE0, DMA Suspend Enable Register */
#define DMA_SUSENR56 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011AE0u)

/** Alias (User Manual Name) for DMA_SUSENR56.
* To use register names with standard convension, please use DMA_SUSENR56.
*/
#define	DMA_SUSENR056	(DMA_SUSENR56)

/** \\brief  1AE4, DMA Suspend Enable Register */
#define DMA_SUSENR57 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011AE4u)

/** Alias (User Manual Name) for DMA_SUSENR57.
* To use register names with standard convension, please use DMA_SUSENR57.
*/
#define	DMA_SUSENR057	(DMA_SUSENR57)

/** \\brief  1AE8, DMA Suspend Enable Register */
#define DMA_SUSENR58 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011AE8u)

/** Alias (User Manual Name) for DMA_SUSENR58.
* To use register names with standard convension, please use DMA_SUSENR58.
*/
#define	DMA_SUSENR058	(DMA_SUSENR58)

/** \\brief  1AEC, DMA Suspend Enable Register */
#define DMA_SUSENR59 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011AECu)

/** Alias (User Manual Name) for DMA_SUSENR59.
* To use register names with standard convension, please use DMA_SUSENR59.
*/
#define	DMA_SUSENR059	(DMA_SUSENR59)

/** \\brief  1A18, DMA Suspend Enable Register */
#define DMA_SUSENR6 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011A18u)

/** Alias (User Manual Name) for DMA_SUSENR6.
* To use register names with standard convension, please use DMA_SUSENR6.
*/
#define	DMA_SUSENR006	(DMA_SUSENR6)

/** \\brief  1AF0, DMA Suspend Enable Register */
#define DMA_SUSENR60 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011AF0u)

/** Alias (User Manual Name) for DMA_SUSENR60.
* To use register names with standard convension, please use DMA_SUSENR60.
*/
#define	DMA_SUSENR060	(DMA_SUSENR60)

/** \\brief  1AF4, DMA Suspend Enable Register */
#define DMA_SUSENR61 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011AF4u)

/** Alias (User Manual Name) for DMA_SUSENR61.
* To use register names with standard convension, please use DMA_SUSENR61.
*/
#define	DMA_SUSENR061	(DMA_SUSENR61)

/** \\brief  1AF8, DMA Suspend Enable Register */
#define DMA_SUSENR62 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011AF8u)

/** Alias (User Manual Name) for DMA_SUSENR62.
* To use register names with standard convension, please use DMA_SUSENR62.
*/
#define	DMA_SUSENR062	(DMA_SUSENR62)

/** \\brief  1AFC, DMA Suspend Enable Register */
#define DMA_SUSENR63 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011AFCu)

/** Alias (User Manual Name) for DMA_SUSENR63.
* To use register names with standard convension, please use DMA_SUSENR63.
*/
#define	DMA_SUSENR063	(DMA_SUSENR63)

/** \\brief  1B00, DMA Suspend Enable Register */
#define DMA_SUSENR64 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B00u)

/** Alias (User Manual Name) for DMA_SUSENR64.
* To use register names with standard convension, please use DMA_SUSENR64.
*/
#define	DMA_SUSENR064	(DMA_SUSENR64)

/** \\brief  1B04, DMA Suspend Enable Register */
#define DMA_SUSENR65 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B04u)

/** Alias (User Manual Name) for DMA_SUSENR65.
* To use register names with standard convension, please use DMA_SUSENR65.
*/
#define	DMA_SUSENR065	(DMA_SUSENR65)

/** \\brief  1B08, DMA Suspend Enable Register */
#define DMA_SUSENR66 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B08u)

/** Alias (User Manual Name) for DMA_SUSENR66.
* To use register names with standard convension, please use DMA_SUSENR66.
*/
#define	DMA_SUSENR066	(DMA_SUSENR66)

/** \\brief  1B0C, DMA Suspend Enable Register */
#define DMA_SUSENR67 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B0Cu)

/** Alias (User Manual Name) for DMA_SUSENR67.
* To use register names with standard convension, please use DMA_SUSENR67.
*/
#define	DMA_SUSENR067	(DMA_SUSENR67)

/** \\brief  1B10, DMA Suspend Enable Register */
#define DMA_SUSENR68 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B10u)

/** Alias (User Manual Name) for DMA_SUSENR68.
* To use register names with standard convension, please use DMA_SUSENR68.
*/
#define	DMA_SUSENR068	(DMA_SUSENR68)

