HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxDma_reg.h
/** \\brief  1B14, DMA Suspend Enable Register */
#define DMA_SUSENR69 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B14u)

/** Alias (User Manual Name) for DMA_SUSENR69.
* To use register names with standard convension, please use DMA_SUSENR69.
*/
#define	DMA_SUSENR069	(DMA_SUSENR69)

/** \\brief  1A1C, DMA Suspend Enable Register */
#define DMA_SUSENR7 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011A1Cu)

/** Alias (User Manual Name) for DMA_SUSENR7.
* To use register names with standard convension, please use DMA_SUSENR7.
*/
#define	DMA_SUSENR007	(DMA_SUSENR7)

/** \\brief  1B18, DMA Suspend Enable Register */
#define DMA_SUSENR70 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B18u)

/** Alias (User Manual Name) for DMA_SUSENR70.
* To use register names with standard convension, please use DMA_SUSENR70.
*/
#define	DMA_SUSENR070	(DMA_SUSENR70)

/** \\brief  1B1C, DMA Suspend Enable Register */
#define DMA_SUSENR71 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B1Cu)

/** Alias (User Manual Name) for DMA_SUSENR71.
* To use register names with standard convension, please use DMA_SUSENR71.
*/
#define	DMA_SUSENR071	(DMA_SUSENR71)

/** \\brief  1B20, DMA Suspend Enable Register */
#define DMA_SUSENR72 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B20u)

/** Alias (User Manual Name) for DMA_SUSENR72.
* To use register names with standard convension, please use DMA_SUSENR72.
*/
#define	DMA_SUSENR072	(DMA_SUSENR72)

/** \\brief  1B24, DMA Suspend Enable Register */
#define DMA_SUSENR73 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B24u)

/** Alias (User Manual Name) for DMA_SUSENR73.
* To use register names with standard convension, please use DMA_SUSENR73.
*/
#define	DMA_SUSENR073	(DMA_SUSENR73)

/** \\brief  1B28, DMA Suspend Enable Register */
#define DMA_SUSENR74 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B28u)

/** Alias (User Manual Name) for DMA_SUSENR74.
* To use register names with standard convension, please use DMA_SUSENR74.
*/
#define	DMA_SUSENR074	(DMA_SUSENR74)

/** \\brief  1B2C, DMA Suspend Enable Register */
#define DMA_SUSENR75 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B2Cu)

/** Alias (User Manual Name) for DMA_SUSENR75.
* To use register names with standard convension, please use DMA_SUSENR75.
*/
#define	DMA_SUSENR075	(DMA_SUSENR75)

/** \\brief  1B30, DMA Suspend Enable Register */
#define DMA_SUSENR76 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B30u)

/** Alias (User Manual Name) for DMA_SUSENR76.
* To use register names with standard convension, please use DMA_SUSENR76.
*/
#define	DMA_SUSENR076	(DMA_SUSENR76)

/** \\brief  1B34, DMA Suspend Enable Register */
#define DMA_SUSENR77 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B34u)

/** Alias (User Manual Name) for DMA_SUSENR77.
* To use register names with standard convension, please use DMA_SUSENR77.
*/
#define	DMA_SUSENR077	(DMA_SUSENR77)

/** \\brief  1B38, DMA Suspend Enable Register */
#define DMA_SUSENR78 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B38u)

/** Alias (User Manual Name) for DMA_SUSENR78.
* To use register names with standard convension, please use DMA_SUSENR78.
*/
#define	DMA_SUSENR078	(DMA_SUSENR78)

/** \\brief  1B3C, DMA Suspend Enable Register */
#define DMA_SUSENR79 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B3Cu)

/** Alias (User Manual Name) for DMA_SUSENR79.
* To use register names with standard convension, please use DMA_SUSENR79.
*/
#define	DMA_SUSENR079	(DMA_SUSENR79)

/** \\brief  1A20, DMA Suspend Enable Register */
#define DMA_SUSENR8 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011A20u)

/** Alias (User Manual Name) for DMA_SUSENR8.
* To use register names with standard convension, please use DMA_SUSENR8.
*/
#define	DMA_SUSENR008	(DMA_SUSENR8)

/** \\brief  1B40, DMA Suspend Enable Register */
#define DMA_SUSENR80 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B40u)

/** Alias (User Manual Name) for DMA_SUSENR80.
* To use register names with standard convension, please use DMA_SUSENR80.
*/
#define	DMA_SUSENR080	(DMA_SUSENR80)

/** \\brief  1B44, DMA Suspend Enable Register */
#define DMA_SUSENR81 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B44u)

/** Alias (User Manual Name) for DMA_SUSENR81.
* To use register names with standard convension, please use DMA_SUSENR81.
*/
#define	DMA_SUSENR081	(DMA_SUSENR81)

/** \\brief  1B48, DMA Suspend Enable Register */
#define DMA_SUSENR82 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B48u)

/** Alias (User Manual Name) for DMA_SUSENR82.
* To use register names with standard convension, please use DMA_SUSENR82.
*/
#define	DMA_SUSENR082	(DMA_SUSENR82)

/** \\brief  1B4C, DMA Suspend Enable Register */
#define DMA_SUSENR83 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B4Cu)

/** Alias (User Manual Name) for DMA_SUSENR83.
* To use register names with standard convension, please use DMA_SUSENR83.
*/
#define	DMA_SUSENR083	(DMA_SUSENR83)

/** \\brief  1B50, DMA Suspend Enable Register */
#define DMA_SUSENR84 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B50u)

/** Alias (User Manual Name) for DMA_SUSENR84.
* To use register names with standard convension, please use DMA_SUSENR84.
*/
#define	DMA_SUSENR084	(DMA_SUSENR84)

/** \\brief  1B54, DMA Suspend Enable Register */
#define DMA_SUSENR85 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B54u)

/** Alias (User Manual Name) for DMA_SUSENR85.
* To use register names with standard convension, please use DMA_SUSENR85.
*/
#define	DMA_SUSENR085	(DMA_SUSENR85)

/** \\brief  1B58, DMA Suspend Enable Register */
#define DMA_SUSENR86 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B58u)

/** Alias (User Manual Name) for DMA_SUSENR86.
* To use register names with standard convension, please use DMA_SUSENR86.
*/
#define	DMA_SUSENR086	(DMA_SUSENR86)

/** \\brief  1B5C, DMA Suspend Enable Register */
#define DMA_SUSENR87 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B5Cu)

/** Alias (User Manual Name) for DMA_SUSENR87.
* To use register names with standard convension, please use DMA_SUSENR87.
*/
#define	DMA_SUSENR087	(DMA_SUSENR87)

/** \\brief  1B60, DMA Suspend Enable Register */
#define DMA_SUSENR88 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B60u)

