HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxDma_reg.h
/** Alias (User Manual Name) for DMA_SUSENR88.
* To use register names with standard convension, please use DMA_SUSENR88.
*/
#define	DMA_SUSENR088	(DMA_SUSENR88)

/** \\brief  1B64, DMA Suspend Enable Register */
#define DMA_SUSENR89 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B64u)

/** Alias (User Manual Name) for DMA_SUSENR89.
* To use register names with standard convension, please use DMA_SUSENR89.
*/
#define	DMA_SUSENR089	(DMA_SUSENR89)

/** \\brief  1A24, DMA Suspend Enable Register */
#define DMA_SUSENR9 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011A24u)

/** Alias (User Manual Name) for DMA_SUSENR9.
* To use register names with standard convension, please use DMA_SUSENR9.
*/
#define	DMA_SUSENR009	(DMA_SUSENR9)

/** \\brief  1B68, DMA Suspend Enable Register */
#define DMA_SUSENR90 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B68u)

/** Alias (User Manual Name) for DMA_SUSENR90.
* To use register names with standard convension, please use DMA_SUSENR90.
*/
#define	DMA_SUSENR090	(DMA_SUSENR90)

/** \\brief  1B6C, DMA Suspend Enable Register */
#define DMA_SUSENR91 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B6Cu)

/** Alias (User Manual Name) for DMA_SUSENR91.
* To use register names with standard convension, please use DMA_SUSENR91.
*/
#define	DMA_SUSENR091	(DMA_SUSENR91)

/** \\brief  1B70, DMA Suspend Enable Register */
#define DMA_SUSENR92 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B70u)

/** Alias (User Manual Name) for DMA_SUSENR92.
* To use register names with standard convension, please use DMA_SUSENR92.
*/
#define	DMA_SUSENR092	(DMA_SUSENR92)

/** \\brief  1B74, DMA Suspend Enable Register */
#define DMA_SUSENR93 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B74u)

/** Alias (User Manual Name) for DMA_SUSENR93.
* To use register names with standard convension, please use DMA_SUSENR93.
*/
#define	DMA_SUSENR093	(DMA_SUSENR93)

/** \\brief  1B78, DMA Suspend Enable Register */
#define DMA_SUSENR94 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B78u)

/** Alias (User Manual Name) for DMA_SUSENR94.
* To use register names with standard convension, please use DMA_SUSENR94.
*/
#define	DMA_SUSENR094	(DMA_SUSENR94)

/** \\brief  1B7C, DMA Suspend Enable Register */
#define DMA_SUSENR95 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B7Cu)

/** Alias (User Manual Name) for DMA_SUSENR95.
* To use register names with standard convension, please use DMA_SUSENR95.
*/
#define	DMA_SUSENR095	(DMA_SUSENR95)

/** \\brief  1B80, DMA Suspend Enable Register */
#define DMA_SUSENR96 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B80u)

/** Alias (User Manual Name) for DMA_SUSENR96.
* To use register names with standard convension, please use DMA_SUSENR96.
*/
#define	DMA_SUSENR096	(DMA_SUSENR96)

/** \\brief  1B84, DMA Suspend Enable Register */
#define DMA_SUSENR97 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B84u)

/** Alias (User Manual Name) for DMA_SUSENR97.
* To use register names with standard convension, please use DMA_SUSENR97.
*/
#define	DMA_SUSENR097	(DMA_SUSENR97)

/** \\brief  1B88, DMA Suspend Enable Register */
#define DMA_SUSENR98 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B88u)

/** Alias (User Manual Name) for DMA_SUSENR98.
* To use register names with standard convension, please use DMA_SUSENR98.
*/
#define	DMA_SUSENR098	(DMA_SUSENR98)

/** \\brief  1B8C, DMA Suspend Enable Register */
#define DMA_SUSENR99 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B8Cu)

/** Alias (User Manual Name) for DMA_SUSENR99.
* To use register names with standard convension, please use DMA_SUSENR99.
*/
#define	DMA_SUSENR099	(DMA_SUSENR99)

/** \\brief  1210, Time Register */
#define DMA_TIME /*lint --e(923)*/ (*(volatile Ifx_DMA_TIME*)0xF0011210u)

/** \\brief  1E00, DMA Transaction State Register */
#define DMA_TSR0 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011E00u)

/** Alias (User Manual Name) for DMA_TSR0.
* To use register names with standard convension, please use DMA_TSR0.
*/
#define	DMA_TSR000	(DMA_TSR0)

/** \\brief  1E04, DMA Transaction State Register */
#define DMA_TSR1 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011E04u)

/** Alias (User Manual Name) for DMA_TSR1.
* To use register names with standard convension, please use DMA_TSR1.
*/
#define	DMA_TSR001	(DMA_TSR1)

/** \\brief  1E28, DMA Transaction State Register */
#define DMA_TSR10 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011E28u)

/** Alias (User Manual Name) for DMA_TSR10.
* To use register names with standard convension, please use DMA_TSR10.
*/
#define	DMA_TSR010	(DMA_TSR10)

/** \\brief  1F90, DMA Transaction State Register */
#define DMA_TSR100 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F90u)

/** \\brief  1F94, DMA Transaction State Register */
#define DMA_TSR101 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F94u)

/** \\brief  1F98, DMA Transaction State Register */
#define DMA_TSR102 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F98u)

/** \\brief  1F9C, DMA Transaction State Register */
#define DMA_TSR103 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F9Cu)

/** \\brief  1FA0, DMA Transaction State Register */
#define DMA_TSR104 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011FA0u)

/** \\brief  1FA4, DMA Transaction State Register */
#define DMA_TSR105 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011FA4u)

/** \\brief  1FA8, DMA Transaction State Register */
#define DMA_TSR106 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011FA8u)

/** \\brief  1FAC, DMA Transaction State Register */
#define DMA_TSR107 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011FACu)

/** \\brief  1FB0, DMA Transaction State Register */
#define DMA_TSR108 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011FB0u)

/** \\brief  1FB4, DMA Transaction State Register */
#define DMA_TSR109 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011FB4u)

/** \\brief  1E2C, DMA Transaction State Register */
#define DMA_TSR11 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011E2Cu)

/** Alias (User Manual Name) for DMA_TSR11.
* To use register names with standard convension, please use DMA_TSR11.
*/
#define	DMA_TSR011	(DMA_TSR11)

/** \\brief  1FB8, DMA Transaction State Register */
#define DMA_TSR110 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011FB8u)

