HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxDma_reg.h
/** \\brief  1FBC, DMA Transaction State Register */
#define DMA_TSR111 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011FBCu)

/** \\brief  1FC0, DMA Transaction State Register */
#define DMA_TSR112 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011FC0u)

/** \\brief  1FC4, DMA Transaction State Register */
#define DMA_TSR113 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011FC4u)

/** \\brief  1FC8, DMA Transaction State Register */
#define DMA_TSR114 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011FC8u)

/** \\brief  1FCC, DMA Transaction State Register */
#define DMA_TSR115 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011FCCu)

/** \\brief  1FD0, DMA Transaction State Register */
#define DMA_TSR116 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011FD0u)

/** \\brief  1FD4, DMA Transaction State Register */
#define DMA_TSR117 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011FD4u)

/** \\brief  1FD8, DMA Transaction State Register */
#define DMA_TSR118 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011FD8u)

/** \\brief  1FDC, DMA Transaction State Register */
#define DMA_TSR119 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011FDCu)

/** \\brief  1E30, DMA Transaction State Register */
#define DMA_TSR12 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011E30u)

/** Alias (User Manual Name) for DMA_TSR12.
* To use register names with standard convension, please use DMA_TSR12.
*/
#define	DMA_TSR012	(DMA_TSR12)

/** \\brief  1FE0, DMA Transaction State Register */
#define DMA_TSR120 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011FE0u)

/** \\brief  1FE4, DMA Transaction State Register */
#define DMA_TSR121 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011FE4u)

/** \\brief  1FE8, DMA Transaction State Register */
#define DMA_TSR122 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011FE8u)

/** \\brief  1FEC, DMA Transaction State Register */
#define DMA_TSR123 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011FECu)

/** \\brief  1FF0, DMA Transaction State Register */
#define DMA_TSR124 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011FF0u)

/** \\brief  1FF4, DMA Transaction State Register */
#define DMA_TSR125 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011FF4u)

/** \\brief  1FF8, DMA Transaction State Register */
#define DMA_TSR126 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011FF8u)

/** \\brief  1FFC, DMA Transaction State Register */
#define DMA_TSR127 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011FFCu)

/** \\brief  1E34, DMA Transaction State Register */
#define DMA_TSR13 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011E34u)

/** Alias (User Manual Name) for DMA_TSR13.
* To use register names with standard convension, please use DMA_TSR13.
*/
#define	DMA_TSR013	(DMA_TSR13)

/** \\brief  1E38, DMA Transaction State Register */
#define DMA_TSR14 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011E38u)

/** Alias (User Manual Name) for DMA_TSR14.
* To use register names with standard convension, please use DMA_TSR14.
*/
#define	DMA_TSR014	(DMA_TSR14)

/** \\brief  1E3C, DMA Transaction State Register */
#define DMA_TSR15 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011E3Cu)

/** Alias (User Manual Name) for DMA_TSR15.
* To use register names with standard convension, please use DMA_TSR15.
*/
#define	DMA_TSR015	(DMA_TSR15)

/** \\brief  1E40, DMA Transaction State Register */
#define DMA_TSR16 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011E40u)

/** Alias (User Manual Name) for DMA_TSR16.
* To use register names with standard convension, please use DMA_TSR16.
*/
#define	DMA_TSR016	(DMA_TSR16)

/** \\brief  1E44, DMA Transaction State Register */
#define DMA_TSR17 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011E44u)

/** Alias (User Manual Name) for DMA_TSR17.
* To use register names with standard convension, please use DMA_TSR17.
*/
#define	DMA_TSR017	(DMA_TSR17)

/** \\brief  1E48, DMA Transaction State Register */
#define DMA_TSR18 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011E48u)

/** Alias (User Manual Name) for DMA_TSR18.
* To use register names with standard convension, please use DMA_TSR18.
*/
#define	DMA_TSR018	(DMA_TSR18)

/** \\brief  1E4C, DMA Transaction State Register */
#define DMA_TSR19 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011E4Cu)

/** Alias (User Manual Name) for DMA_TSR19.
* To use register names with standard convension, please use DMA_TSR19.
*/
#define	DMA_TSR019	(DMA_TSR19)

/** \\brief  1E08, DMA Transaction State Register */
#define DMA_TSR2 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011E08u)

/** Alias (User Manual Name) for DMA_TSR2.
* To use register names with standard convension, please use DMA_TSR2.
*/
#define	DMA_TSR002	(DMA_TSR2)

/** \\brief  1E50, DMA Transaction State Register */
#define DMA_TSR20 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011E50u)

/** Alias (User Manual Name) for DMA_TSR20.
* To use register names with standard convension, please use DMA_TSR20.
*/
#define	DMA_TSR020	(DMA_TSR20)

/** \\brief  1E54, DMA Transaction State Register */
#define DMA_TSR21 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011E54u)

/** Alias (User Manual Name) for DMA_TSR21.
* To use register names with standard convension, please use DMA_TSR21.
*/
#define	DMA_TSR021	(DMA_TSR21)

/** \\brief  1E58, DMA Transaction State Register */
#define DMA_TSR22 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011E58u)

/** Alias (User Manual Name) for DMA_TSR22.
* To use register names with standard convension, please use DMA_TSR22.
*/
#define	DMA_TSR022	(DMA_TSR22)

/** \\brief  1E5C, DMA Transaction State Register */
#define DMA_TSR23 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011E5Cu)

/** Alias (User Manual Name) for DMA_TSR23.
* To use register names with standard convension, please use DMA_TSR23.
*/
#define	DMA_TSR023	(DMA_TSR23)

/** \\brief  1E60, DMA Transaction State Register */
#define DMA_TSR24 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011E60u)

/** Alias (User Manual Name) for DMA_TSR24.
* To use register names with standard convension, please use DMA_TSR24.
*/
#define	DMA_TSR024	(DMA_TSR24)

