HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxDma_reg.h
/** \\brief  1EB8, DMA Transaction State Register */
#define DMA_TSR46 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011EB8u)

/** Alias (User Manual Name) for DMA_TSR46.
* To use register names with standard convension, please use DMA_TSR46.
*/
#define	DMA_TSR046	(DMA_TSR46)

/** \\brief  1EBC, DMA Transaction State Register */
#define DMA_TSR47 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011EBCu)

/** Alias (User Manual Name) for DMA_TSR47.
* To use register names with standard convension, please use DMA_TSR47.
*/
#define	DMA_TSR047	(DMA_TSR47)

/** \\brief  1EC0, DMA Transaction State Register */
#define DMA_TSR48 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011EC0u)

/** Alias (User Manual Name) for DMA_TSR48.
* To use register names with standard convension, please use DMA_TSR48.
*/
#define	DMA_TSR048	(DMA_TSR48)

/** \\brief  1EC4, DMA Transaction State Register */
#define DMA_TSR49 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011EC4u)

/** Alias (User Manual Name) for DMA_TSR49.
* To use register names with standard convension, please use DMA_TSR49.
*/
#define	DMA_TSR049	(DMA_TSR49)

/** \\brief  1E14, DMA Transaction State Register */
#define DMA_TSR5 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011E14u)

/** Alias (User Manual Name) for DMA_TSR5.
* To use register names with standard convension, please use DMA_TSR5.
*/
#define	DMA_TSR005	(DMA_TSR5)

/** \\brief  1EC8, DMA Transaction State Register */
#define DMA_TSR50 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011EC8u)

/** Alias (User Manual Name) for DMA_TSR50.
* To use register names with standard convension, please use DMA_TSR50.
*/
#define	DMA_TSR050	(DMA_TSR50)

/** \\brief  1ECC, DMA Transaction State Register */
#define DMA_TSR51 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011ECCu)

/** Alias (User Manual Name) for DMA_TSR51.
* To use register names with standard convension, please use DMA_TSR51.
*/
#define	DMA_TSR051	(DMA_TSR51)

/** \\brief  1ED0, DMA Transaction State Register */
#define DMA_TSR52 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011ED0u)

/** Alias (User Manual Name) for DMA_TSR52.
* To use register names with standard convension, please use DMA_TSR52.
*/
#define	DMA_TSR052	(DMA_TSR52)

/** \\brief  1ED4, DMA Transaction State Register */
#define DMA_TSR53 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011ED4u)

/** Alias (User Manual Name) for DMA_TSR53.
* To use register names with standard convension, please use DMA_TSR53.
*/
#define	DMA_TSR053	(DMA_TSR53)

/** \\brief  1ED8, DMA Transaction State Register */
#define DMA_TSR54 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011ED8u)

/** Alias (User Manual Name) for DMA_TSR54.
* To use register names with standard convension, please use DMA_TSR54.
*/
#define	DMA_TSR054	(DMA_TSR54)

/** \\brief  1EDC, DMA Transaction State Register */
#define DMA_TSR55 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011EDCu)

/** Alias (User Manual Name) for DMA_TSR55.
* To use register names with standard convension, please use DMA_TSR55.
*/
#define	DMA_TSR055	(DMA_TSR55)

/** \\brief  1EE0, DMA Transaction State Register */
#define DMA_TSR56 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011EE0u)

/** Alias (User Manual Name) for DMA_TSR56.
* To use register names with standard convension, please use DMA_TSR56.
*/
#define	DMA_TSR056	(DMA_TSR56)

/** \\brief  1EE4, DMA Transaction State Register */
#define DMA_TSR57 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011EE4u)

/** Alias (User Manual Name) for DMA_TSR57.
* To use register names with standard convension, please use DMA_TSR57.
*/
#define	DMA_TSR057	(DMA_TSR57)

/** \\brief  1EE8, DMA Transaction State Register */
#define DMA_TSR58 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011EE8u)

/** Alias (User Manual Name) for DMA_TSR58.
* To use register names with standard convension, please use DMA_TSR58.
*/
#define	DMA_TSR058	(DMA_TSR58)

/** \\brief  1EEC, DMA Transaction State Register */
#define DMA_TSR59 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011EECu)

/** Alias (User Manual Name) for DMA_TSR59.
* To use register names with standard convension, please use DMA_TSR59.
*/
#define	DMA_TSR059	(DMA_TSR59)

/** \\brief  1E18, DMA Transaction State Register */
#define DMA_TSR6 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011E18u)

/** Alias (User Manual Name) for DMA_TSR6.
* To use register names with standard convension, please use DMA_TSR6.
*/
#define	DMA_TSR006	(DMA_TSR6)

/** \\brief  1EF0, DMA Transaction State Register */
#define DMA_TSR60 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011EF0u)

/** Alias (User Manual Name) for DMA_TSR60.
* To use register names with standard convension, please use DMA_TSR60.
*/
#define	DMA_TSR060	(DMA_TSR60)

/** \\brief  1EF4, DMA Transaction State Register */
#define DMA_TSR61 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011EF4u)

/** Alias (User Manual Name) for DMA_TSR61.
* To use register names with standard convension, please use DMA_TSR61.
*/
#define	DMA_TSR061	(DMA_TSR61)

/** \\brief  1EF8, DMA Transaction State Register */
#define DMA_TSR62 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011EF8u)

/** Alias (User Manual Name) for DMA_TSR62.
* To use register names with standard convension, please use DMA_TSR62.
*/
#define	DMA_TSR062	(DMA_TSR62)

/** \\brief  1EFC, DMA Transaction State Register */
#define DMA_TSR63 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011EFCu)

/** Alias (User Manual Name) for DMA_TSR63.
* To use register names with standard convension, please use DMA_TSR63.
*/
#define	DMA_TSR063	(DMA_TSR63)

/** \\brief  1F00, DMA Transaction State Register */
#define DMA_TSR64 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F00u)

/** Alias (User Manual Name) for DMA_TSR64.
* To use register names with standard convension, please use DMA_TSR64.
*/
#define	DMA_TSR064	(DMA_TSR64)

/** \\brief  1F04, DMA Transaction State Register */
#define DMA_TSR65 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F04u)

/** Alias (User Manual Name) for DMA_TSR65.
* To use register names with standard convension, please use DMA_TSR65.
*/
#define	DMA_TSR065	(DMA_TSR65)

/** \\brief  1F08, DMA Transaction State Register */
#define DMA_TSR66 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F08u)

