HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxDma_reg.h
/** Alias (User Manual Name) for DMA_TSR66.
* To use register names with standard convension, please use DMA_TSR66.
*/
#define	DMA_TSR066	(DMA_TSR66)

/** \\brief  1F0C, DMA Transaction State Register */
#define DMA_TSR67 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F0Cu)

/** Alias (User Manual Name) for DMA_TSR67.
* To use register names with standard convension, please use DMA_TSR67.
*/
#define	DMA_TSR067	(DMA_TSR67)

/** \\brief  1F10, DMA Transaction State Register */
#define DMA_TSR68 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F10u)

/** Alias (User Manual Name) for DMA_TSR68.
* To use register names with standard convension, please use DMA_TSR68.
*/
#define	DMA_TSR068	(DMA_TSR68)

/** \\brief  1F14, DMA Transaction State Register */
#define DMA_TSR69 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F14u)

/** Alias (User Manual Name) for DMA_TSR69.
* To use register names with standard convension, please use DMA_TSR69.
*/
#define	DMA_TSR069	(DMA_TSR69)

/** \\brief  1E1C, DMA Transaction State Register */
#define DMA_TSR7 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011E1Cu)

/** Alias (User Manual Name) for DMA_TSR7.
* To use register names with standard convension, please use DMA_TSR7.
*/
#define	DMA_TSR007	(DMA_TSR7)

/** \\brief  1F18, DMA Transaction State Register */
#define DMA_TSR70 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F18u)

/** Alias (User Manual Name) for DMA_TSR70.
* To use register names with standard convension, please use DMA_TSR70.
*/
#define	DMA_TSR070	(DMA_TSR70)

/** \\brief  1F1C, DMA Transaction State Register */
#define DMA_TSR71 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F1Cu)

/** Alias (User Manual Name) for DMA_TSR71.
* To use register names with standard convension, please use DMA_TSR71.
*/
#define	DMA_TSR071	(DMA_TSR71)

/** \\brief  1F20, DMA Transaction State Register */
#define DMA_TSR72 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F20u)

/** Alias (User Manual Name) for DMA_TSR72.
* To use register names with standard convension, please use DMA_TSR72.
*/
#define	DMA_TSR072	(DMA_TSR72)

/** \\brief  1F24, DMA Transaction State Register */
#define DMA_TSR73 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F24u)

/** Alias (User Manual Name) for DMA_TSR73.
* To use register names with standard convension, please use DMA_TSR73.
*/
#define	DMA_TSR073	(DMA_TSR73)

/** \\brief  1F28, DMA Transaction State Register */
#define DMA_TSR74 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F28u)

/** Alias (User Manual Name) for DMA_TSR74.
* To use register names with standard convension, please use DMA_TSR74.
*/
#define	DMA_TSR074	(DMA_TSR74)

/** \\brief  1F2C, DMA Transaction State Register */
#define DMA_TSR75 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F2Cu)

/** Alias (User Manual Name) for DMA_TSR75.
* To use register names with standard convension, please use DMA_TSR75.
*/
#define	DMA_TSR075	(DMA_TSR75)

/** \\brief  1F30, DMA Transaction State Register */
#define DMA_TSR76 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F30u)

/** Alias (User Manual Name) for DMA_TSR76.
* To use register names with standard convension, please use DMA_TSR76.
*/
#define	DMA_TSR076	(DMA_TSR76)

/** \\brief  1F34, DMA Transaction State Register */
#define DMA_TSR77 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F34u)

/** Alias (User Manual Name) for DMA_TSR77.
* To use register names with standard convension, please use DMA_TSR77.
*/
#define	DMA_TSR077	(DMA_TSR77)

/** \\brief  1F38, DMA Transaction State Register */
#define DMA_TSR78 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F38u)

/** Alias (User Manual Name) for DMA_TSR78.
* To use register names with standard convension, please use DMA_TSR78.
*/
#define	DMA_TSR078	(DMA_TSR78)

/** \\brief  1F3C, DMA Transaction State Register */
#define DMA_TSR79 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F3Cu)

/** Alias (User Manual Name) for DMA_TSR79.
* To use register names with standard convension, please use DMA_TSR79.
*/
#define	DMA_TSR079	(DMA_TSR79)

/** \\brief  1E20, DMA Transaction State Register */
#define DMA_TSR8 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011E20u)

/** Alias (User Manual Name) for DMA_TSR8.
* To use register names with standard convension, please use DMA_TSR8.
*/
#define	DMA_TSR008	(DMA_TSR8)

/** \\brief  1F40, DMA Transaction State Register */
#define DMA_TSR80 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F40u)

/** Alias (User Manual Name) for DMA_TSR80.
* To use register names with standard convension, please use DMA_TSR80.
*/
#define	DMA_TSR080	(DMA_TSR80)

/** \\brief  1F44, DMA Transaction State Register */
#define DMA_TSR81 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F44u)

/** Alias (User Manual Name) for DMA_TSR81.
* To use register names with standard convension, please use DMA_TSR81.
*/
#define	DMA_TSR081	(DMA_TSR81)

/** \\brief  1F48, DMA Transaction State Register */
#define DMA_TSR82 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F48u)

/** Alias (User Manual Name) for DMA_TSR82.
* To use register names with standard convension, please use DMA_TSR82.
*/
#define	DMA_TSR082	(DMA_TSR82)

/** \\brief  1F4C, DMA Transaction State Register */
#define DMA_TSR83 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F4Cu)

/** Alias (User Manual Name) for DMA_TSR83.
* To use register names with standard convension, please use DMA_TSR83.
*/
#define	DMA_TSR083	(DMA_TSR83)

/** \\brief  1F50, DMA Transaction State Register */
#define DMA_TSR84 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F50u)

/** Alias (User Manual Name) for DMA_TSR84.
* To use register names with standard convension, please use DMA_TSR84.
*/
#define	DMA_TSR084	(DMA_TSR84)

/** \\brief  1F54, DMA Transaction State Register */
#define DMA_TSR85 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F54u)

/** Alias (User Manual Name) for DMA_TSR85.
* To use register names with standard convension, please use DMA_TSR85.
*/
#define	DMA_TSR085	(DMA_TSR85)

/** \\brief  1F58, DMA Transaction State Register */
#define DMA_TSR86 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F58u)

/** Alias (User Manual Name) for DMA_TSR86.
* To use register names with standard convension, please use DMA_TSR86.
*/
#define	DMA_TSR086	(DMA_TSR86)

/** \\brief  1F5C, DMA Transaction State Register */
#define DMA_TSR87 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F5Cu)

/** Alias (User Manual Name) for DMA_TSR87.
* To use register names with standard convension, please use DMA_TSR87.
*/
#define	DMA_TSR087	(DMA_TSR87)

