HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxDma_reg.h
/** \\brief  1F60, DMA Transaction State Register */
#define DMA_TSR88 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F60u)

/** Alias (User Manual Name) for DMA_TSR88.
* To use register names with standard convension, please use DMA_TSR88.
*/
#define	DMA_TSR088	(DMA_TSR88)

/** \\brief  1F64, DMA Transaction State Register */
#define DMA_TSR89 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F64u)

/** Alias (User Manual Name) for DMA_TSR89.
* To use register names with standard convension, please use DMA_TSR89.
*/
#define	DMA_TSR089	(DMA_TSR89)

/** \\brief  1E24, DMA Transaction State Register */
#define DMA_TSR9 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011E24u)

/** Alias (User Manual Name) for DMA_TSR9.
* To use register names with standard convension, please use DMA_TSR9.
*/
#define	DMA_TSR009	(DMA_TSR9)

/** \\brief  1F68, DMA Transaction State Register */
#define DMA_TSR90 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F68u)

/** Alias (User Manual Name) for DMA_TSR90.
* To use register names with standard convension, please use DMA_TSR90.
*/
#define	DMA_TSR090	(DMA_TSR90)

/** \\brief  1F6C, DMA Transaction State Register */
#define DMA_TSR91 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F6Cu)

/** Alias (User Manual Name) for DMA_TSR91.
* To use register names with standard convension, please use DMA_TSR91.
*/
#define	DMA_TSR091	(DMA_TSR91)

/** \\brief  1F70, DMA Transaction State Register */
#define DMA_TSR92 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F70u)

/** Alias (User Manual Name) for DMA_TSR92.
* To use register names with standard convension, please use DMA_TSR92.
*/
#define	DMA_TSR092	(DMA_TSR92)

/** \\brief  1F74, DMA Transaction State Register */
#define DMA_TSR93 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F74u)

/** Alias (User Manual Name) for DMA_TSR93.
* To use register names with standard convension, please use DMA_TSR93.
*/
#define	DMA_TSR093	(DMA_TSR93)

/** \\brief  1F78, DMA Transaction State Register */
#define DMA_TSR94 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F78u)

/** Alias (User Manual Name) for DMA_TSR94.
* To use register names with standard convension, please use DMA_TSR94.
*/
#define	DMA_TSR094	(DMA_TSR94)

/** \\brief  1F7C, DMA Transaction State Register */
#define DMA_TSR95 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F7Cu)

/** Alias (User Manual Name) for DMA_TSR95.
* To use register names with standard convension, please use DMA_TSR95.
*/
#define	DMA_TSR095	(DMA_TSR95)

/** \\brief  1F80, DMA Transaction State Register */
#define DMA_TSR96 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F80u)

/** Alias (User Manual Name) for DMA_TSR96.
* To use register names with standard convension, please use DMA_TSR96.
*/
#define	DMA_TSR096	(DMA_TSR96)

/** \\brief  1F84, DMA Transaction State Register */
#define DMA_TSR97 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F84u)

/** Alias (User Manual Name) for DMA_TSR97.
* To use register names with standard convension, please use DMA_TSR97.
*/
#define	DMA_TSR097	(DMA_TSR97)

/** \\brief  1F88, DMA Transaction State Register */
#define DMA_TSR98 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F88u)

/** Alias (User Manual Name) for DMA_TSR98.
* To use register names with standard convension, please use DMA_TSR98.
*/
#define	DMA_TSR098	(DMA_TSR98)

/** \\brief  1F8C, DMA Transaction State Register */
#define DMA_TSR99 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F8Cu)

/** Alias (User Manual Name) for DMA_TSR99.
* To use register names with standard convension, please use DMA_TSR99.
*/
#define	DMA_TSR099	(DMA_TSR99)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXDMA_REG_H */
